README.org
#+TITLE:    LDSC-ProjetoEngenharia-0-Metodologia-Instrucoes-Etapas

* Link:

- O repositório https://github.com/ldsc/LDSC-ProjetoEngenharia-0-Metodologia-Instrucoes-Etapas contém informações sobre a metodologia adotada no desenvolvimento do projeto de engenharia.

- Este arquivo que você esta lendo contém:
  - um resumo da metodologia adotada.
  - uma lista de repositórios e projetos desenvolvidos em anos anteriores.

* Versão: 
- 1.0.

* Data:
- 2024/1 - primeiro semestre.
  
* Autor de Contato:
- André Duarte Bueno
- [[mailto:andreduartebueno@gmail.com][andreduartebueno@gmail.com]]
- [[mailto:bueno@lenep.uenf.br][bueno@lenep.uenf.br]]

* Áreas de pesquisa vinculadas:
- Modelagem Computacional (Algoritmos).
- Modelagem de Software (UML).
- Programação Orientada a Objeto.
- Programação em C++.
- Programação Paralela e Concorrente.
- Engenharia de Petróleo.
- Gestão de Projetos de Engenharia (métodos tradicionais e ágeis).
- Administração (gestão de projetos e processos).

* Disciplinas vinculadas:
- [[https://sites.google.com/view/professorandreduartebueno/ensino/fundamentos-de-programa%C3%A7%C3%A3o-em-c][Disciplina Fundamentos de Ciência da Computação]].
- [[https://sites.google.com/view/professorandreduartebueno/ensino/introdu%C3%A7%C3%A3o-ao-projeto-de-engenharia][Disciplina Introdução ao Projeto de Engenharia]].
- [[https://sites.google.com/view/professorandreduartebueno/ensino/prog-orientada-objeto-c-2024][Disciplina Programação Orientada a Objeto com C++]].
- [[https://sites.google.com/view/professorandreduartebueno/ensino/projeto-de-software-aplicado][Disciplina Projeto de Software Aplicado]].
- [[https://sites.google.com/view/professorandreduartebueno/ensino/programa%C3%A7%C3%A3o-paralela-e-concorrente][Disciplina Programação Paralela e Concorrente]].
    
* Links:
- [[https://sites.google.com/view/professorandreduartebueno/][Site do Professor André Duarte Bueno]].
- [[https://github.com/ldsc][Site do *LDSC - Laboratório de Desenvolvimento de Software Científico e Aplicado* no github]].
- [[https://uenf.br/cct/lenep][Site do LENEP]].

