README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-03-05 ter 14:57 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>LDSC-ProjetoEngenharia-0-Metodologia-Instrucoes-Etapas</title>
<meta name="author" content="&lt;André Duarte Bueno&gt;" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">LDSC-ProjetoEngenharia-0-Metodologia-Instrucoes-Etapas</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org8eb5719">1. Link:</a></li>
<li><a href="#orga623545">2. Versão:</a></li>
<li><a href="#org11935ab">3. Data:</a></li>
<li><a href="#org44c447c">4. Autor de Contato:</a></li>
<li><a href="#orgb89d3c9">5. Áreas de pesquisa vinculadas:</a></li>
<li><a href="#org546c392">6. Disciplinas vinculadas:</a></li>
<li><a href="#orga20ab3f">7. Links:</a></li>
<li><a href="#org6b5fd0b">8. Resumo da metodologia</a></li>
<li><a href="#org932ce34">9. Lista de Repositórios do LDSC</a></li>
<li><a href="#org0675b78">10. Repositórios com instruções e modelos</a>
<ul>
<li><a href="#org7fa4948">10.1. Título: UENF-CCT-LENEP-Repositorio-Documentos</a></li>
<li><a href="#orgd766e02">10.2. Título: LDSC-Ajuda-DocumentosAuxiliares</a></li>
<li><a href="#org8017014">10.3. Título: LDSC-ProjetoEngenharia-0-Metodologia-Instrucoes-Etapas</a></li>
<li><a href="#org52c32cc">10.4. Título: LDSC-ProjetoEngenharia-1-PropostaDeDesafio-TituloDoDesafioTecnologico</a></li>
<li><a href="#orgdd91d5a">10.5. Título: LDSC-ProjetoEngenharia-2-Software-TituloProjeto-ModeloCompleto</a></li>
<li><a href="#orgbe0c8ac">10.6. Título: LDSC-ProjetoEngenharia-2-Software-TituloProjeto-ModeloAntigoDesativado</a></li>
<li><a href="#org94b200a">10.7. Título: LDSC-Modelo-TrabalhoAcademico-01-OrganizacaoPessoal</a></li>
<li><a href="#org5b2bf37">10.8. Título: LDSC-Modelo-TrabalhoAcademico-02-ArquivoUnico</a></li>
<li><a href="#org35806cb">10.9. Título: LDSC-Modelo-DiretorioAlunoBolsista-TCC-IC-MSC-DSC-Projeto</a></li>
</ul>
</li>
<li><a href="#orgdeef986">11. Repositórios de bibliotecas desenvolvidas</a>
<ul>
<li><a href="#org16eb7e5">11.1. Título: Biblioteca lib<sub>ldsc</sub></a></li>
</ul>
</li>
<li><a href="#org4f0bbc0">12. Repositórios de softwares desenvolvidos</a>
<ul>
<li><a href="#org810d321">12.1. Título: Software LVP - Laboratório Virtual de Petrofísica</a></li>
<li><a href="#org6627858">12.2. Título: Simulat - Simulador Transferência Calor e Massa em Meios Porosos</a></li>
<li><a href="#org9a78919">12.3. Título: Software-CaracterizacaoDeRochaDigitalUsando-IA-InteligenciaArtificial-SegmentacaoImagens</a></li>
<li><a href="#orged0b569">12.4. Título: SAIL - Software de Análise de Imagens Livre</a></li>
<li><a href="#org0c3f485">12.5. Título: TCMP-2D</a></li>
<li><a href="#orged5791c">12.6. Título: ProjetoEngenharia-STC-3D-SimuladorDeTransferenciaDeCalor-3D</a></li>
</ul>
</li>
<li><a href="#org8770a8f">13. Repositórios de projetos desenvolvidos</a>
<ul>
<li><a href="#org47b3f44">13.1. Título: ProjetoEngenharia-AnaliseDoEfeitoDePeliculaAPartirIPR-PocosVerticais-EscoamentoMonofasico</a></li>
<li><a href="#org16b1896">13.2. Título: ProjetoEngenharia-AnaliseQuedaPressaoDevidoMigracaoFinosOcasionadaInjecaoAguaBaixaSalinidade</a></li>
<li><a href="#orge471005">13.3. Título: ProjetoEngenharia-AplicacaoCorrelacoesCalculoParametrosReservartorioPropriedadesFluidos-Blackoil</a></li>
<li><a href="#org6b9a7fa">13.4. Título: ProjetoEngenharia-AutomacaoDaDefinicaoDoVolumeElementarRepresentativo</a></li>
<li><a href="#org26e13cb">13.5. Título: ProjetoEngenharia-AvaliacaoCondicaoExperimentalSeparacaoComponentesDoPetroleoPorCromatografiaLiquida</a></li>
<li><a href="#orgec0a34e">13.6. Título: ProjetoEngenharia-AvaliacaoDasCondicoesExperimentaisParaSeparacaoDeComponentesDoPetroleoPorCromatogr</a></li>
<li><a href="#org73d7bd0">13.7. Título: ProjetoEngenharia-AvaliacaoFormacoesPorDadosDeTestesDePressao</a></li>
<li><a href="#orgf94bd02">13.8. Título: ProjetoEngenharia-BancoDeDadosFluidosPerfuracao</a></li>
<li><a href="#orgc1db4a3">13.9. Título: ProjetoEngenharia-CalculoDaTrajetoriaDirecionalParaperfuracaoDePocosDePetroleo-TIPO-1-BUILD-AND-HOLD</a></li>
<li><a href="#org0715c49">13.10. Título: ProjetoEngenharia-CalculoDosFatoresDeRecuperacaoAvancadaDePetroleoAPartirDeTesteDeFluxoEmMeiosPoroso</a></li>
<li><a href="#org17cc19f">13.11. Título: ProjetoEngenharia-CalculoIndiceProdutividadePocos</a></li>
<li><a href="#orgacbba61">13.12. Título: ProjetoEngenharia-CalculoPerdaCargaDistribuidaFluidoNoDecorrerEscoamento</a></li>
<li><a href="#org6138ab6">13.13. Título: ProjetoEngenharia-CalculoVolumesFluidosPerfuracaoCimentacaoTubosETempoPerfuracao</a></li>
<li><a href="#org9b635e6">13.14. Título: ProjetoEngenharia-CorrelacoesPVT</a></li>
<li><a href="#org8bff0f4">13.15. Título: ProjetoEngenharia-ESPPERFORMANCE-SimuladorDeCurvasDeDesempenhoDe-BCS-HEAD-ePerdasCarga</a></li>
<li><a href="#org9f5933b">13.16. Título: ProjetoEngenharia-FluxoMonofasicoReativoEmMeiosPorosos</a></li>
<li><a href="#org049fe3e">13.17. Título: ProjetoEngenharia-ModelosDeAquiferosAnaliticos</a></li>
<li><a href="#org3669c99">13.18. Título: ProjetoEngenharia-ModelosDeDeslocamentoImiscivelParaRecuperacaoSecundariaDePetroleo</a></li>
<li><a href="#org63bf2a2">13.19. Título: ProjetoEngenharia-PrevisaoComportamentoDeReservatoriosDeOleoComCapaDeGasOuGasEmSolucaoEOleo-GasComIn</a></li>
<li><a href="#org4238522">13.20. Título: ProjetoEngenharia-PropriedadesFisicasRochasSedimentaresUtilizandoDadosObtidosPorAnaliseDeImagens</a></li>
<li><a href="#org7aefa29">13.21. Título: ProjetoEngenharia-SimulacaoDeCurvasIPRUtilizandoModelosEmpiricosEmPocosVerticais</a></li>
<li><a href="#org8c865fb">13.22. Título: ProjetoEngenharia-SimulacaoPropriedadesTermodinamicasSubstanciasSimplesECompostas</a></li>
<li><a href="#orgf5b362c">13.23. Título: ProjetoEngenharia-SimuladorDeEstimativaDeReservaUtilizandoEBM-EnfoqueReservatoriosGas</a></li>
<li><a href="#org91029fb">13.24. Título: ProjetoEngenharia-SimuladorDeReservatorioMonofasico2D</a></li>
<li><a href="#orge117cf7">13.25. Título: ProjetoEngenharia-SimuladorDeTracoSismico</a></li>
<li><a href="#org697106b">13.26. Título: ProjetoEngenharia-SimuladorHidraulicaPerfuracaoPoco</a></li>
<li><a href="#orgb023f85">13.27. Título: ProjetoEngenharia-SimuladorPropriedadesMaterialSubmetidoCorrosaoPorDioxidoDeCarbono</a></li>
<li><a href="#orgc1f92ce">13.28. Título: rojetoEngenharia-SimuladorReservatorio2D</a></li>
<li><a href="#orgddb5b71">13.29. Título: ProjetoEngenharia-SimuladorSolucoesAnaliticasAdmensionaisEqDifusividadeHidraulicaFluxosLinearERadial</a></li>
<li><a href="#org9e20694">13.30. Título: ProjetoEngenharia-SimuladorSubstituicaoFluidoEmodelagemAVO</a></li>
<li><a href="#org4c3b2c2">13.31. Título: ProjetoEngenharia-SoftwareCaracterizacaoDeReservatoriosIntegradoAAnalisePetrofisica</a></li>
<li><a href="#orga27d2fd">13.32. Título: ProjetoEngenharia-SoftwareControlador-MedidorDeBancadaAz-pH-mV-ORP-Cond-TDS-SALT</a></li>
<li><a href="#orge60f553">13.33. Título: rojetoEngenharia-SoftwareDeComunicacao-MedidorLCR</a></li>
<li><a href="#orgf17cdb9">13.34. Título: ProjetoEngenharia-SoftwareParaCalculoDeIncrustacaoNaProducaoDePetroleo</a></li>
<li><a href="#orgccb193e">13.35. Título: ProjetoEngenharia-SoftwareParaCalculoDePropriedadesReologicasDeFluidosDePerfuracao</a></li>
<li><a href="#org8730bf3">13.36. Título: ProjetoEngenharia-SoftwareParaTratamentosDeDados-FT-ICR-MS-e-Aplica-esGeoquimicas</a></li>
<li><a href="#org43f22b5">13.37. Título: ProjetoEngenharia-SoftwareQueCalculaPropriedadesPetrofisicasPocoAPartirEquacoesDaFisica</a></li>
<li><a href="#org50f846a">13.38. Título: ProjetoEngenharia-SPTSP-Helmholtz</a></li>
<li><a href="#org318b25f">13.39. Título: ProjetoEngenharia-STC-3D-SimuladorDeTransferenciaDeCalor-3D</a></li>
<li><a href="#org664367e">13.40. Título: ProjetoEngenharia-TratamentoEstatisticoDadosGeoquimicos</a></li>
</ul>
</li>
<li><a href="#orga7cc6a0">14. Repositórios com projetos didáticos</a>
<ul>
<li><a href="#orge5b99f5">14.1. Título: ProjetoEngenharia-SistemaAcademico (didático)</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org8eb5719" class="outline-2">
<h2 id="org8eb5719"><span class="section-number-2">1.</span> Link:</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>O repositório <a href="https://github.com/ldsc/LDSC-ProjetoEngenharia-0-Metodologia-Instrucoes-Etapas">https://github.com/ldsc/LDSC-ProjetoEngenharia-0-Metodologia-Instrucoes-Etapas</a> contém informações sobre a metodologia adotada no desenvolvimento do projeto de engenharia. Projeto vinculado as disciplinas de modelagem computacional.</li>

<li>Este arquivo que você esta lendo contém:
<ul class="org-ul">
<li>um resumo da metodologia adotada.</li>
<li>uma lista de repositórios e projetos desenvolvidos em anos anteriores.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orga623545" class="outline-2">
<h2 id="orga623545"><span class="section-number-2">2.</span> Versão:</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>1.0.</li>
</ul>
</div>
</div>

<div id="outline-container-org11935ab" class="outline-2">
<h2 id="org11935ab"><span class="section-number-2">3.</span> Data:</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>2024/1 - primeiro semestre.</li>
</ul>
</div>
</div>

<div id="outline-container-org44c447c" class="outline-2">
<h2 id="org44c447c"><span class="section-number-2">4.</span> Autor de Contato:</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>André Duarte Bueno</li>
<li><a href="mailto:andreduartebueno@gmail.com">andreduartebueno@gmail.com</a></li>
<li><a href="mailto:bueno@lenep.uenf.br">bueno@lenep.uenf.br</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgb89d3c9" class="outline-2">
<h2 id="orgb89d3c9"><span class="section-number-2">5.</span> Áreas de pesquisa vinculadas:</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>Modelagem Computacional (Algoritmos).</li>
<li>Modelagem de Software (UML).</li>
<li>Programação Orientada a Objeto.</li>
<li>Programação em C++.</li>
<li>Programação Paralela e Concorrente.</li>
<li>Engenharia de Petróleo.</li>
<li>Gestão de Projetos de Engenharia (métodos tradicionais e ágeis).</li>
<li>Administração (gestão de projetos e processos).</li>
</ul>
</div>
</div>

<div id="outline-container-org546c392" class="outline-2">
<h2 id="org546c392"><span class="section-number-2">6.</span> Disciplinas vinculadas:</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li><a href="https://sites.google.com/view/professorandreduartebueno/ensino/fundamentos-de-programa%C3%A7%C3%A3o-em-c">Disciplina Fundamentos de Ciência da Computação</a>.</li>
<li><a href="https://sites.google.com/view/professorandreduartebueno/ensino/introdu%C3%A7%C3%A3o-ao-projeto-de-engenharia">Disciplina Introdução ao Projeto de Engenharia</a>.</li>
<li><a href="https://sites.google.com/view/professorandreduartebueno/ensino/prog-orientada-objeto-c-2024">Disciplina Programação Orientada a Objeto com C++</a>.</li>
<li><a href="https://sites.google.com/view/professorandreduartebueno/ensino/projeto-de-software-aplicado">Disciplina Projeto de Software Aplicado</a>.</li>
<li><a href="https://sites.google.com/view/professorandreduartebueno/ensino/programa%C3%A7%C3%A3o-paralela-e-concorrente">Disciplina Programação Paralela e Concorrente</a>.</li>
</ul>
</div>
</div>

<div id="outline-container-orga20ab3f" class="outline-2">
<h2 id="orga20ab3f"><span class="section-number-2">7.</span> Links:</h2>
<div class="outline-text-2" id="text-7">
<ul class="org-ul">
<li><a href="https://sites.google.com/view/professorandreduartebueno/">Site do Professor André Duarte Bueno</a>.</li>
<li><a href="https://github.com/ldsc">Site do <b>LDSC - Laboratório de Desenvolvimento de Software Científico e Aplicado</b> no github</a>.</li>
<li><a href="https://uenf.br/cct/lenep">Site do LENEP</a>.</li>
</ul>
</div>
</div>
