README.org
* Resumo da metodologia

A metodologia irá cobrir as etapas para o desenvolvimento de um projeto de engenharia completo.
Fazemos uma relação com o conceito de Nível de Maturidade Tecnológica ou TRL.
O TRL é utilizado nos projetos da Petrobras (os desafios tecnológicos da Petrobras).

Etapas: 
0 - O professor ou empresa de engenharia elabora um desafio tecnológico ([[https://docs.google.com/forms/d/e/1FAIpQLSc1NaIUvKIFzECj3KPv6JRiD7kXFFd5MeAY1w-JI_yDjrbZmQ/viewform][formulário desafio tecnológico]]).
Uma lista de desafios é apresentada nesta [[https://docs.google.com/spreadsheets/d/1mFAjcRhzuePATaSSUSYo3_JaVmPkIi0L7ZfrQe0MMSU/edit?usp=sharing][planilha]].
Uma lista de projetos antigos é apresentada ao longo deste documento.

1 - A equipe de alunos seleciona o projeto de seu interesse e elabora um pré-projeto (um esboço); Este pré-projeto é então levado ao professor/empresa que montou o desafio e ao professor da disciplina para aprovarem o pré-projeto.  A ideia aqui é ter certeza que os alunos entenderam o que o professor/empresa quer.

2- Os alunos montam o projeto (detalhamento do pré-projeto; documento formal que descreve o que vai ser feito).
Ex: os contratos de projeto que assinamos com a Petrobras.

3- Os alunos fazem a modelagem de engenharia com acompanhamento dos professores.

4- Os alunos desenvolvem o software em si (ciclos de planejamento/refinar a modelagem; implementar os códigos; realizar testes; montar a documentação).

5- Entrega/defesa do produto final.


* Lista de Repositórios do LDSC
Veja a seguir uma lista de repositórios do LDSC, estão disponíveis repositórios com informações em geral, modelos de documentos e projetos, exemplos de projetos desenvolvidos em anos anteriores.

* <<1>>Repositórios com instruções e modelos
** Título: UENF-CCT-LENEP-Repositorio-Documentos
- Link no github:
  - https://github.com/ldsc/UENF-CCT-LENEP-Repositorio-Documentos
- Resumo:
  - Arquivos da UENF, CCT, LENEP para apoio a alunos.
- Área:
  - Administrativa.

** Título: LDSC-Ajuda-DocumentosAuxiliares
- Link no github:
  - https://github.com/ldsc/LDSC-Ajuda-DocumentosAuxiliares
- Resumo:
  - Informações sobre softwares e sistemas utilizados nas disciplinas de modelagem computacional do LENEP/CCT/UENF.
- Área:
  - Modelagem computacional.

** Título: LDSC-ProjetoEngenharia-0-Metodologia-Instrucoes-Etapas
- Link no github:
  - https://github.com/ldsc/LDSC-ProjetoEngenharia-0-Metodologia-Instrucoes-Etapas
- Resumo:
  - Repositório com informações sobre a metodologia adotada no desenvolvimento do projeto de engenharia vinculado as disciplinas de modelagem computacional.
- Área:
  - Modelagem computacional.

** Título: LDSC-ProjetoEngenharia-1-PropostaDeDesafio-TituloDoDesafioTecnologico
- Link no github:
  - https://github.com/ldsc/LDSC-ProjetoEngenharia-1-PropostaDeDesafio-TituloDoDesafioTecnologico
- Resumo:
  - Repositório com modelo de proposta de desafio tecnológico.
  - A proposta de desafio tecnológico pode ser feita por professores e profissionais da indústria (empresas).
- Área:
  - Modelagem computacional.
  - Engenharia de petróleo.

** Título: LDSC-ProjetoEngenharia-2-Software-TituloProjeto-ModeloCompleto
- Link no github:
  - https://github.com/ldsc/LDSC-ProjetoEngenharia-2-Software-TituloProjeto-ModeloCompleto
- Resumo:
  - Modelo de projeto de engenharia (usado a partir de 2024/1 cobrindo as disciplinas de modelagem computacional).
  - Inclui um conjunto de diretórios e arquivos dos softwares utilizados (ex.: modelos do lyx, umbrello).
- Área:
  - Projeto de engenharia.
  - Modelagem computacional.
  - Engenharia de petróleo.

** Título: LDSC-ProjetoEngenharia-2-Software-TituloProjeto-ModeloAntigoDesativado
- Link no github:
  - https://github.com/ldsc/LDSC-ProjetoEngenharia-2-Software-TituloProjeto-ModeloAntigoDesativado
- Resumo:
  - Modelo de projeto de engenharia (usado até 2023/2).
  - Não incluia a parte de gestão (metodologia, desafio tecnológico, pré-projeto e projeto).

** Título: LDSC-Modelo-TrabalhoAcademico-01-OrganizacaoPessoal
- Link no github:
  - https://github.com/ldsc/LDSC-Modelo-TrabalhoAcademico-01-OrganizacaoPessoal
- Resumo:
  - Repositório com modelo de arquivo do lyx para confecção do trabalho acadêmico que visa ajudar na organização pessoal dos novos alunos.
  - Usado por alunos de Introdução à Engenharia.
- Área:
  - Ensino.
  - Gestão pessoal.

** Título: LDSC-Modelo-TrabalhoAcademico-02-ArquivoUnico
- Link no github:
  - https://github.com/ldsc/LDSC-Modelo-TrabalhoAcademico-02-ArquivoUnico
- Resumo:
  - Repositório com modelo de arquivo do lyx para confecção do trabalho acadêmico de pequeno porte usando o editor LyX.
- Área:
  - Ensino.

** Título: LDSC-Modelo-DiretorioAlunoBolsista-TCC-IC-MSC-DSC-Projeto
- Link no github:
  - https://github.com/ldsc/LDSC-Modelo-DiretorioAlunoBolsista-TCC-IC-MSC-DSC-Projeto
- Resumo:
  - Diretório com subdiretórios e arquivos para alunos de IC, MSC, DSC. Inclui modelos para TeX/LaTeX/LyX.
- Área:
  - Metodologia científica.
  - Organização/gestão pessoal.
* <<2>>Repositórios de bibliotecas desenvolvidas

