README.html

<div id="outline-container-org6b5fd0b" class="outline-2">
<h2 id="org6b5fd0b"><span class="section-number-2">8.</span> Resumo da metodologia</h2>
<div class="outline-text-2" id="text-8">
<p>
A metodologia irá cobrir as etapas para o desenvolvimento de um projeto de engenharia completo.
Fazemos uma relação com o conceito de Nível de Maturidade Tecnológica ou TRL.
O TRL é utilizado nos projetos da Petrobras (os desafios tecnológicos da Petrobras).
</p>

<p>
Etapas: 
0 - O professor ou empresa de engenharia elabora um desafio tecnológico (<a href="https://docs.google.com/forms/d/e/1FAIpQLSc1NaIUvKIFzECj3KPv6JRiD7kXFFd5MeAY1w-JI_yDjrbZmQ/viewform">formulário desafio tecnológico</a>).
Uma lista de desafios é apresentada nesta <a href="https://docs.google.com/spreadsheets/d/1mFAjcRhzuePATaSSUSYo3_JaVmPkIi0L7ZfrQe0MMSU/edit?usp=sharing">planilha</a>.
Uma lista de projetos antigos é apresentada ao longo deste documento.
</p>

<p>
1 - A equipe de alunos seleciona o projeto de seu interesse e elabora um pré-projeto (um esboço); Este pré-projeto é então levado ao professor/empresa que montou o desafio e ao professor da disciplina para aprovarem o pré-projeto.  A ideia aqui é ter certeza que os alunos entenderam o que o professor/empresa quer.
</p>

<p>
2- Os alunos montam o projeto (detalhamento do pré-projeto; documento formal que descreve o que vai ser feito).
Ex: os contratos de projeto que assinamos com a Petrobras.
</p>

<p>
3- Os alunos fazem a modelagem de engenharia com acompanhamento dos professores.
</p>

<p>
4- Os alunos desenvolvem o software em si (ciclos de planejamento/refinar a modelagem; implementar os códigos; realizar testes; montar a documentação).
</p>

<p>
5- Entrega/defesa do produto final.
</p>
</div>
</div>


<div id="outline-container-org932ce34" class="outline-2">
<h2 id="org932ce34"><span class="section-number-2">9.</span> Lista de Repositórios do LDSC</h2>
<div class="outline-text-2" id="text-9">
<p>
Veja a seguir uma lista de repositórios do LDSC, estão disponíveis repositórios com informações em geral, modelos de documentos e projetos, exemplos de projetos desenvolvidos em anos anteriores.
</p>
</div>
</div>

<div id="outline-container-org0675b78" class="outline-2">
<h2 id="org0675b78"><span class="section-number-2">10.</span> <a id="orgf8655b8"></a>Repositórios com instruções e modelos</h2>
<div class="outline-text-2" id="text-10">
</div>
<div id="outline-container-org7fa4948" class="outline-3">
<h3 id="org7fa4948"><span class="section-number-3">10.1.</span> Título: UENF-CCT-LENEP-Repositorio-Documentos</h3>
<div class="outline-text-3" id="text-10-1">
<ul class="org-ul">
<li>Link no github:
<ul class="org-ul">
<li><a href="https://github.com/ldsc/UENF-CCT-LENEP-Repositorio-Documentos">https://github.com/ldsc/UENF-CCT-LENEP-Repositorio-Documentos</a></li>
</ul></li>
<li>Resumo:
<ul class="org-ul">
<li>Arquivos da UENF, CCT, LENEP para apoio a alunos.</li>
</ul></li>
<li>Área:
<ul class="org-ul">
<li>Administrativa.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgd766e02" class="outline-3">
<h3 id="orgd766e02"><span class="section-number-3">10.2.</span> Título: LDSC-Ajuda-DocumentosAuxiliares</h3>
<div class="outline-text-3" id="text-10-2">
<ul class="org-ul">
<li>Link no github:
<ul class="org-ul">
<li><a href="https://github.com/ldsc/LDSC-Ajuda-DocumentosAuxiliares">https://github.com/ldsc/LDSC-Ajuda-DocumentosAuxiliares</a></li>
</ul></li>
<li>Resumo:
<ul class="org-ul">
<li>Informações sobre softwares e sistemas utilizados nas disciplinas de modelagem computacional do LENEP/CCT/UENF.</li>
</ul></li>
<li>Área:
<ul class="org-ul">
<li>Modelagem computacional.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org8017014" class="outline-3">
<h3 id="org8017014"><span class="section-number-3">10.3.</span> Título: LDSC-ProjetoEngenharia-0-Metodologia-Instrucoes-Etapas</h3>
<div class="outline-text-3" id="text-10-3">
<ul class="org-ul">
<li>Link no github:
<ul class="org-ul">
<li><a href="https://github.com/ldsc/LDSC-ProjetoEngenharia-0-Metodologia-Instrucoes-Etapas">https://github.com/ldsc/LDSC-ProjetoEngenharia-0-Metodologia-Instrucoes-Etapas</a></li>
</ul></li>
<li>Resumo:
<ul class="org-ul">
<li>Repositório com informações sobre a metodologia adotada no desenvolvimento do projeto de engenharia vinculado as disciplinas de modelagem computacional.</li>
</ul></li>
<li>Área:
<ul class="org-ul">
<li>Modelagem computacional.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org52c32cc" class="outline-3">
<h3 id="org52c32cc"><span class="section-number-3">10.4.</span> Título: LDSC-ProjetoEngenharia-1-PropostaDeDesafio-TituloDoDesafioTecnologico</h3>
<div class="outline-text-3" id="text-10-4">
<ul class="org-ul">
<li>Link no github:
<ul class="org-ul">
<li><a href="https://github.com/ldsc/LDSC-ProjetoEngenharia-1-PropostaDeDesafio-TituloDoDesafioTecnologico">https://github.com/ldsc/LDSC-ProjetoEngenharia-1-PropostaDeDesafio-TituloDoDesafioTecnologico</a></li>
</ul></li>
<li>Resumo:
<ul class="org-ul">
<li>Repositório com modelo de proposta de desafio tecnológico.</li>
<li>A proposta de desafio tecnológico pode ser feita por professores e profissionais da indústria (empresas).</li>
</ul></li>
<li>Área:
<ul class="org-ul">
<li>Modelagem computacional.</li>
<li>Engenharia de petróleo.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgdd91d5a" class="outline-3">
<h3 id="orgdd91d5a"><span class="section-number-3">10.5.</span> Título: LDSC-ProjetoEngenharia-2-Software-TituloProjeto-ModeloCompleto</h3>
<div class="outline-text-3" id="text-10-5">
<ul class="org-ul">
<li>Link no github:
<ul class="org-ul">
<li><a href="https://github.com/ldsc/LDSC-ProjetoEngenharia-2-Software-TituloProjeto-ModeloCompleto">https://github.com/ldsc/LDSC-ProjetoEngenharia-2-Software-TituloProjeto-ModeloCompleto</a></li>
</ul></li>
<li>Resumo:
<ul class="org-ul">
<li>Modelo de projeto de engenharia (usado a partir de 2024/1 cobrindo as disciplinas de modelagem computacional).</li>
<li>Inclui um conjunto de diretórios e arquivos dos softwares utilizados (ex.: modelos do lyx, umbrello).</li>
</ul></li>
<li>Área:
<ul class="org-ul">
<li>Projeto de engenharia.</li>
<li>Modelagem computacional.</li>
<li>Engenharia de petróleo.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgbe0c8ac" class="outline-3">
<h3 id="orgbe0c8ac"><span class="section-number-3">10.6.</span> Título: LDSC-ProjetoEngenharia-2-Software-TituloProjeto-ModeloAntigoDesativado</h3>
<div class="outline-text-3" id="text-10-6">
<ul class="org-ul">
<li>Link no github:
<ul class="org-ul">
<li><a href="https://github.com/ldsc/LDSC-ProjetoEngenharia-2-Software-TituloProjeto-ModeloAntigoDesativado">https://github.com/ldsc/LDSC-ProjetoEngenharia-2-Software-TituloProjeto-ModeloAntigoDesativado</a></li>
</ul></li>
<li>Resumo:
<ul class="org-ul">
<li>Modelo de projeto de engenharia (usado até 2023/2).</li>
<li>Não incluia a parte de gestão (metodologia, desafio tecnológico, pré-projeto e projeto).</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org94b200a" class="outline-3">
<h3 id="org94b200a"><span class="section-number-3">10.7.</span> Título: LDSC-Modelo-TrabalhoAcademico-01-OrganizacaoPessoal</h3>
<div class="outline-text-3" id="text-10-7">
<ul class="org-ul">
<li>Link no github:
<ul class="org-ul">
<li><a href="https://github.com/ldsc/LDSC-Modelo-TrabalhoAcademico-01-OrganizacaoPessoal">https://github.com/ldsc/LDSC-Modelo-TrabalhoAcademico-01-OrganizacaoPessoal</a></li>
</ul></li>
<li>Resumo:
<ul class="org-ul">
<li>Repositório com modelo de arquivo do lyx para confecção do trabalho acadêmico que visa ajudar na organização pessoal dos novos alunos.</li>
<li>Usado por alunos de Introdução à Engenharia.</li>
</ul></li>
<li>Área:
<ul class="org-ul">
<li>Ensino.</li>
<li>Gestão pessoal.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org5b2bf37" class="outline-3">
<h3 id="org5b2bf37"><span class="section-number-3">10.8.</span> Título: LDSC-Modelo-TrabalhoAcademico-02-ArquivoUnico</h3>
<div class="outline-text-3" id="text-10-8">
<ul class="org-ul">
<li>Link no github:
<ul class="org-ul">
<li><a href="https://github.com/ldsc/LDSC-Modelo-TrabalhoAcademico-02-ArquivoUnico">https://github.com/ldsc/LDSC-Modelo-TrabalhoAcademico-02-ArquivoUnico</a></li>
</ul></li>
<li>Resumo:
<ul class="org-ul">
<li>Repositório com modelo de arquivo do lyx para confecção do trabalho acadêmico de pequeno porte usando o editor LyX.</li>
</ul></li>
<li>Área:
<ul class="org-ul">
<li>Ensino.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org35806cb" class="outline-3">
<h3 id="org35806cb"><span class="section-number-3">10.9.</span> Título: LDSC-Modelo-DiretorioAlunoBolsista-TCC-IC-MSC-DSC-Projeto</h3>
<div class="outline-text-3" id="text-10-9">
<ul class="org-ul">
<li>Link no github:
<ul class="org-ul">
<li><a href="https://github.com/ldsc/LDSC-Modelo-DiretorioAlunoBolsista-TCC-IC-MSC-DSC-Projeto">https://github.com/ldsc/LDSC-Modelo-DiretorioAlunoBolsista-TCC-IC-MSC-DSC-Projeto</a></li>
</ul></li>
<li>Resumo:
<ul class="org-ul">
<li>Diretório com subdiretórios e arquivos para alunos de IC, MSC, DSC. Inclui modelos para TeX/LaTeX/LyX.</li>
</ul></li>
<li>Área:
<ul class="org-ul">
<li>Metodologia científica.</li>
<li>Organização/gestão pessoal.</li>
</ul></li>
</ul>
</div>
</div>
</div>
