README.org
** Título: Biblioteca lib_ldsc
- Link no github:
  - https://github.com/ldsc/lib_ldsc
- Resumo:
  - A libldsc é uma biblioteca de classes desenvolvidas em C++ para solução de problemas das áreas de:
  - processamento de imagens.
  - meios porosos (rochas reservatório).
  - métodos numéricos.
  - grafos, redes de percolação e redes neurais.
  - O software [[https://github.com/ldsc/lvp][Software LVP]] faz uso extensivo da lib_ldsc.
  - Manual técnico: [[https://github.com/ldsc/lib_ldsc/blob/master/doc/ManualTecnico/Doutorado-AndreDuarteBueno.pdf][Tese doutorado Prof. André Duarte Bueno]]
  - Apresentação:  [[https://github.com/ldsc/lib_ldsc/blob/master/doc/ManualTecnico/ApresentacaoLinhaPesquisaAnaliseDeImagens-ProcParalelo-Bueno-2023-reduzida.pdf][Apresentação linhas de pesquisa que usam a lib_ldsc]]
- Área:
  - Análise e processamento de imagens.
* <<3>>Repositórios de softwares desenvolvidos

** Título: Software LVP - Laboratório Virtual de Petrofísica
- Link no github:
  - https://github.com/ldsc/lvp
- Resumo:
  - O software LVP oferece ao usuário diversas funcionalidades de simulação e determinação de propriedades petrofísicas através da análise de imagens de meios porosos. O propósito inicial no desenvolvimento deste software foi o de facilitar, através de uma interface gráfica amigável e avançada, a utilização dos modelos e algoritmos desenvolvidos como parte de um trabalho de mestrado, e posteriormente de doutorado, realizado na UENF/LENEP pelo aluno Leandro Puerari. Devido ao fato dos trabalhos terem como base a biblioteca para análise de imagens de meios porosos lib_ldsc, diversas outras funcionalidades implementadas nesta biblioteca foram disponibilizadas no LVP.
  - Dentre as funcionalidades podemos destacar:
  - Aplicação de filtros em imagens 2D e 3D, incluindo: conectividade, imagem de distância ao fundo, inversão da imagem, passa-baixa e passa-alta;
  - Aplicação dos filtros morfológicos: fechamento, abertura, dilatação e erosão;
  - Visualização plano a plano de imagens tridimensionais permitindo escolher o eixo de visualização;
  - Visualização de imagens tridimensionais e bidimensionais;
  - Determinação de correlações frequencial e espacial;
  - Determinação da distribuição de tamanho de poros e sólidos;
  - Cálculo da permeabilidade intrínseca; 
  - Cálculo da permeabilidade relativa;
  Visualização das curvas de permeabilidade relativa;
  - Visualização dos gráficos de correlações;
  - Cálculo da porosidade;
  - Rotação de imagens tridimensionais;
  - Corte de imagens tridimensionais;
  - Determinação das configurações de equilíbrio;
  - Reconstruções tridimensionais através dos métodos esferas sobrepostas, gaussiana truncada e gaussiana truncada revisada;
  - Segmentação de poros e gargantas, através de operações morfológicas;
  - Criação de redes de percolação representativas ao meio poroso;
  - Cálculo da permeabilidade intrínseca nas redes de percolação.
  - Autor: Leandro Puerari.
- Área:
  - Análise e processamento de imagens.

** Título: Simulat - Simulador Transferência Calor e Massa em Meios Porosos
- Link no github:
  - https://github.com/ldsc/simulat
- Resumo:
  - Simulador Transferência Calor e Umidade em Telhas Cerâmicas (meios porosos).
  - A partir de propriedades físicas medidas em laboratório permite a simulação dos valores de conteúdo mássico e temperatura de telhas expostas ao meio ambiente.
  - [[https://github.com/ldsc/simulat/blob/master/doc/ManualTecnico/Mestrado-AndreDuarteBueno.pdf][Mestrado-AndreDuarteBueno.pdf]].
  - [[https://github.com/ldsc/simulat/blob/master/doc/ManualTecnico/Mestrado-AndreDuarteBueno-Apresentacao.pdf][Mestrado-AndreDuarteBueno-Apresentacao.pdf]].    
  - [[https://github.com/ldsc/simulat/blob/master/doc/ManualTecnico/Mestrado-AndreDuarteBueno-ImagensSoftwareSimulat.pdf][ImagensSoftwareSimulat]].
- Área:
  - Transferência de calor e massa.
  - Conforto ambiental.

** Título: Software-CaracterizacaoDeRochaDigitalUsando-IA-InteligenciaArtificial-SegmentacaoImagens
- Link no github:
  - https://github.com/ldsc/Software-CaracterizacaoDeRochaDigitalUsando-IA-InteligenciaArtificial-SegmentacaoImagens
- Resumo:
  - Este repositório representa o projeto de dissertação desenvolvido no LENEP/CCT/UENF, como parte das exigências para obtenção do título de Mestre em Engenharia de Reservatório e de Exploração.
  - O objetivo geral deste trabalho foi desenvolver métodos de inteligência artificial capazes de reconhecer padrões relevantes para a análise das propriedades petrofísicas em imagens de rochas reservatórios.
  - No diretório resultados estão os valores obtidos na aplicação da rede neural sobre às amostras de rocha digital junto com o resultado da binarização de cada um delas.
  - Autor: João Marcelo.
- Área:
  - Análise e processamento de imagens. 

** Título: SAIL - Software de Análise de Imagens Livre
- Link no github:
  - adicionar...
- Resumo:
  - Software de Análise de Imagens Livre.
  - Autor: Thiago Schauwer.
- Área:
  - Análise e processamento de imagens.
  - Dano a formação.
  - Engenharia de reservatório.
  - Petrofísica.

** Título: TCMP-2D
- Link no github:
  - https://github.com/ldsc/TCMP-2D
- Resumo:
  - Transferência de Calor em Meios Porosos 2D (Linguagem: C++/Qt; Método Numérico: FTCS/BTCS).
  - Autor: Guilherme Lima.
  - Publicação:
    - [[https://github.com/ldsc/TCMP-2D/blob/master/doc/ManualTecnico/ProjetoEngenharia-GuilhermeLima.pdf][TCC]] 
    - [[https://github.com/ldsc/TCMP-2D/blob/master/doc/ManualTecnico/R3-SimuladorBidimensionaldeConducaoTransientedeCaloremMeiosPorosos-CCMP-2D.pdf][SimuladorBidimensionaldeConducaoTransientedeCaloremMeiosPorosos-CCMP-2D]]

- Área:
  - Transferência de calor.

