README.html
<div id="outline-container-orgdeef986" class="outline-2">
<h2 id="orgdeef986"><span class="section-number-2">11.</span> <a id="orga823062"></a>Repositórios de bibliotecas desenvolvidas</h2>
<div class="outline-text-2" id="text-11">
</div>
<div id="outline-container-org16eb7e5" class="outline-3">
<h3 id="org16eb7e5"><span class="section-number-3">11.1.</span> Título: Biblioteca lib<sub>ldsc</sub></h3>
<div class="outline-text-3" id="text-11-1">
<ul class="org-ul">
<li>Link no github:
<ul class="org-ul">
<li><a href="https://github.com/ldsc/lib_ldsc">https://github.com/ldsc/lib_ldsc</a></li>
</ul></li>
<li>Resumo:
<ul class="org-ul">
<li>A libldsc é uma biblioteca de classes desenvolvidas em C++ para solução de problemas das áreas de:</li>
<li>processamento de imagens.</li>
<li>meios porosos (rochas reservatório).</li>
<li>métodos numéricos.</li>
<li>grafos, redes de percolação e redes neurais.</li>
<li>O software <a href="https://github.com/ldsc/lvp">Software LVP</a> faz uso extensivo da lib<sub>ldsc</sub>.</li>
<li>Manual técnico: <a href="https://github.com/ldsc/lib_ldsc/blob/master/doc/ManualTecnico/Doutorado-AndreDuarteBueno.pdf">Tese doutorado Prof. André Duarte Bueno</a></li>
<li>Apresentação:  <a href="https://github.com/ldsc/lib_ldsc/blob/master/doc/ManualTecnico/ApresentacaoLinhaPesquisaAnaliseDeImagens-ProcParalelo-Bueno-2023-reduzida.pdf">Apresentação linhas de pesquisa que usam a lib<sub>ldsc</sub></a></li>
</ul></li>
<li>Área:
<ul class="org-ul">
<li>Análise e processamento de imagens.</li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org4f0bbc0" class="outline-2">
<h2 id="org4f0bbc0"><span class="section-number-2">12.</span> <a id="org8077c62"></a>Repositórios de softwares desenvolvidos</h2>
<div class="outline-text-2" id="text-12">
</div>
<div id="outline-container-org810d321" class="outline-3">
<h3 id="org810d321"><span class="section-number-3">12.1.</span> Título: Software LVP - Laboratório Virtual de Petrofísica</h3>
<div class="outline-text-3" id="text-12-1">
<ul class="org-ul">
<li>Link no github:
<ul class="org-ul">
<li><a href="https://github.com/ldsc/lvp">https://github.com/ldsc/lvp</a></li>
</ul></li>
<li><p>
Resumo:
</p>
<ul class="org-ul">
<li>O software LVP oferece ao usuário diversas funcionalidades de simulação e determinação de propriedades petrofísicas através da análise de imagens de meios porosos. O propósito inicial no desenvolvimento deste software foi o de facilitar, através de uma interface gráfica amigável e avançada, a utilização dos modelos e algoritmos desenvolvidos como parte de um trabalho de mestrado, e posteriormente de doutorado, realizado na UENF/LENEP pelo aluno Leandro Puerari. Devido ao fato dos trabalhos terem como base a biblioteca para análise de imagens de meios porosos lib<sub>ldsc</sub>, diversas outras funcionalidades implementadas nesta biblioteca foram disponibilizadas no LVP.</li>
<li>Dentre as funcionalidades podemos destacar:</li>
<li>Aplicação de filtros em imagens 2D e 3D, incluindo: conectividade, imagem de distância ao fundo, inversão da imagem, passa-baixa e passa-alta;</li>
<li>Aplicação dos filtros morfológicos: fechamento, abertura, dilatação e erosão;</li>
<li>Visualização plano a plano de imagens tridimensionais permitindo escolher o eixo de visualização;</li>
<li>Visualização de imagens tridimensionais e bidimensionais;</li>
<li>Determinação de correlações frequencial e espacial;</li>
<li>Determinação da distribuição de tamanho de poros e sólidos;</li>
<li>Cálculo da permeabilidade intrínseca;</li>
<li>Cálculo da permeabilidade relativa;</li>
</ul>
<p>
Visualização das curvas de permeabilidade relativa;
</p>
<ul class="org-ul">
<li>Visualização dos gráficos de correlações;</li>
<li>Cálculo da porosidade;</li>
<li>Rotação de imagens tridimensionais;</li>
<li>Corte de imagens tridimensionais;</li>
<li>Determinação das configurações de equilíbrio;</li>
<li>Reconstruções tridimensionais através dos métodos esferas sobrepostas, gaussiana truncada e gaussiana truncada revisada;</li>
<li>Segmentação de poros e gargantas, através de operações morfológicas;</li>
<li>Criação de redes de percolação representativas ao meio poroso;</li>
<li>Cálculo da permeabilidade intrínseca nas redes de percolação.</li>
<li>Autor: Leandro Puerari.</li>
</ul></li>
<li>Área:
<ul class="org-ul">
<li>Análise e processamento de imagens.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org6627858" class="outline-3">
<h3 id="org6627858"><span class="section-number-3">12.2.</span> Título: Simulat - Simulador Transferência Calor e Massa em Meios Porosos</h3>
<div class="outline-text-3" id="text-12-2">
<ul class="org-ul">
<li>Link no github:
<ul class="org-ul">
<li><a href="https://github.com/ldsc/simulat">https://github.com/ldsc/simulat</a></li>
</ul></li>
<li>Resumo:
<ul class="org-ul">
<li>Simulador Transferência Calor e Umidade em Telhas Cerâmicas (meios porosos).</li>
<li>A partir de propriedades físicas medidas em laboratório permite a simulação dos valores de conteúdo mássico e temperatura de telhas expostas ao meio ambiente.</li>
<li><a href="https://github.com/ldsc/simulat/blob/master/doc/ManualTecnico/Mestrado-AndreDuarteBueno.pdf">Mestrado-AndreDuarteBueno.pdf</a>.</li>
<li><a href="https://github.com/ldsc/simulat/blob/master/doc/ManualTecnico/Mestrado-AndreDuarteBueno-Apresentacao.pdf">Mestrado-AndreDuarteBueno-Apresentacao.pdf</a>.</li>
<li><a href="https://github.com/ldsc/simulat/blob/master/doc/ManualTecnico/Mestrado-AndreDuarteBueno-ImagensSoftwareSimulat.pdf">ImagensSoftwareSimulat</a>.</li>
</ul></li>
<li>Área:
<ul class="org-ul">
<li>Transferência de calor e massa.</li>
<li>Conforto ambiental.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org9a78919" class="outline-3">
<h3 id="org9a78919"><span class="section-number-3">12.3.</span> Título: Software-CaracterizacaoDeRochaDigitalUsando-IA-InteligenciaArtificial-SegmentacaoImagens</h3>
<div class="outline-text-3" id="text-12-3">
<ul class="org-ul">
<li>Link no github:
<ul class="org-ul">
<li><a href="https://github.com/ldsc/Software-CaracterizacaoDeRochaDigitalUsando-IA-InteligenciaArtificial-SegmentacaoImagens">https://github.com/ldsc/Software-CaracterizacaoDeRochaDigitalUsando-IA-InteligenciaArtificial-SegmentacaoImagens</a></li>
</ul></li>
<li>Resumo:
<ul class="org-ul">
<li>Este repositório representa o projeto de dissertação desenvolvido no LENEP/CCT/UENF, como parte das exigências para obtenção do título de Mestre em Engenharia de Reservatório e de Exploração.</li>
<li>O objetivo geral deste trabalho foi desenvolver métodos de inteligência artificial capazes de reconhecer padrões relevantes para a análise das propriedades petrofísicas em imagens de rochas reservatórios.</li>
<li>No diretório resultados estão os valores obtidos na aplicação da rede neural sobre às amostras de rocha digital junto com o resultado da binarização de cada um delas.</li>
<li>Autor: João Marcelo.</li>
</ul></li>
<li>Área:
<ul class="org-ul">
<li>Análise e processamento de imagens.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orged0b569" class="outline-3">
<h3 id="orged0b569"><span class="section-number-3">12.4.</span> Título: SAIL - Software de Análise de Imagens Livre</h3>
<div class="outline-text-3" id="text-12-4">
<ul class="org-ul">
<li>Link no github:
<ul class="org-ul">
<li>adicionar&#x2026;</li>
</ul></li>
<li>Resumo:
<ul class="org-ul">
<li>Software de Análise de Imagens Livre.</li>
<li>Autor: Thiago Schauwer.</li>
</ul></li>
<li>Área:
<ul class="org-ul">
<li>Análise e processamento de imagens.</li>
<li>Dano a formação.</li>
<li>Engenharia de reservatório.</li>
<li>Petrofísica.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org0c3f485" class="outline-3">
<h3 id="org0c3f485"><span class="section-number-3">12.5.</span> Título: TCMP-2D</h3>
<div class="outline-text-3" id="text-12-5">
<ul class="org-ul">
<li>Link no github:
<ul class="org-ul">
<li><a href="https://github.com/ldsc/TCMP-2D">https://github.com/ldsc/TCMP-2D</a></li>
</ul></li>
<li>Resumo:
<ul class="org-ul">
<li>Transferência de Calor em Meios Porosos 2D (Linguagem: C++/Qt; Método Numérico: FTCS/BTCS).</li>
<li>Autor: Guilherme Lima.</li>
<li>Publicação:
<ul class="org-ul">
<li><a href="https://github.com/ldsc/TCMP-2D/blob/master/doc/ManualTecnico/ProjetoEngenharia-GuilhermeLima.pdf">TCC</a></li>
<li><a href="https://github.com/ldsc/TCMP-2D/blob/master/doc/ManualTecnico/R3-SimuladorBidimensionaldeConducaoTransientedeCaloremMeiosPorosos-CCMP-2D.pdf">SimuladorBidimensionaldeConducaoTransientedeCaloremMeiosPorosos-CCMP-2D</a></li>
</ul></li>
</ul></li>

<li>Área:
<ul class="org-ul">
<li>Transferência de calor.</li>
</ul></li>
</ul>
</div>
</div>
