README.org
** Título: ProjetoEngenharia-STC-3D-SimuladorDeTransferenciaDeCalor-3D
- Link no github:
  - https://github.com/ldsc/ProjetoEngenharia-STC-3D-SimuladorDeTransferenciaDeCalor-3D
- Resumo:
  - Projeto de engenharia - Simulador de condução térmica em objetos 3D com perfis genéricos.
  - O seguinte projeto de engenharia deve simular a difusão térmica de qualquer objeto tridimensional, onde o usuário desenha a superfície de alguns perfis e escolhe as temperaturas e suas propriedades termofísicas.
  - A equação do Calor será modelada por diferenças finitas pelo modelo BTCS, utilizando fronteiras de Neumann, e a programação utilizará paralelismo e multithreading para acelerar as simulações.
  - No quesito prático, o usuário poderá desenhar a superfície a ser simulada, escolher sua temperatura, propriedades termofísicas e se é fonte/sumidouro ou não. Também terá a liberdade de escolher um ponto para analisar os gráficos da evolução térmica no tempo e espaço, salvar as superfícies dos perfis e carregar essas camadas com todas as suas propriedades e modificá-las. Por fim, o projeto será utilizado para estudar a injeção de calor em reservatórios 2D e 3D, e avaliar a distribuição da temperatura ao longo do tempo no reservatório.
  - Nota: Também foi o TCC do aluno Nikolas.    
- Área:
  - Transferência de calor.
- Autor:
  - Nikolas Almeida Pinto.
  - Publicação:
    - [[https://github.com/ldsc/ProjetoEngenharia-STC-3D-SimuladorDeTransferenciaDeCalor-3D/blob/master/doc/ManualTecnico/TCC-NikolasAlmeidaPinto.pdf][TCC]] 
    - [[https://github.com/ldsc/ProjetoEngenharia-STC-3D-SimuladorDeTransferenciaDeCalor-3D/blob/master/doc/ManualTecnico/Apresentacao_Nicholas_TCC2.pptx][Apresentacao]]
- 
* <<4>>Repositórios de projetos desenvolvidos

** Título: ProjetoEngenharia-AnaliseDoEfeitoDePeliculaAPartirIPR-PocosVerticais-EscoamentoMonofasico
- Link no github:
  - https://github.com/ldsc/ProjetoEngenharia-AnaliseDoEfeitoDePeliculaAPartirIPR-PocosVerticais-EscoamentoMonofasico
- Resumo:
  - ANÁLISE DO EFEITO DE PELÍCULA A PARTIR DE CURVAS DE ÍNDICE DE PRODUTIVIDADE (IPR) PARA POÇOS VERTICAIS EM ESCOAMENTO MONOFÁSICO DE ÓLEO.
  - Utilizar equações propostas na literatura e em artigos cientı́ficos para o cálculo do efeito de pelı́cula total.
  - Plotar curvas de IPR para poços verticais em escoamento monofásico de óleo a partir de soluções analı́ticas da E.D.H. considerando regime transiente, pseu-do permanente e permanente a partir do software externo Gnuplot.
- Área:
  - Engenharia de reservatório.

** Título: ProjetoEngenharia-AnaliseQuedaPressaoDevidoMigracaoFinosOcasionadaInjecaoAguaBaixaSalinidade
- Link no github:
  - https://github.com/ldsc/ProjetoEngenharia-AnaliseQuedaPressaoDevidoMigracaoFinosOcasionadaInjecaoAguaBaixaSalinidade
- Resumo:
  - ANÁLISE DA QUEDA DE PRESSÃO DEVIDO A MIGRAÇÃO DE FINOS OCASIONADA PELA INJEÇÃO DE ÁGUA DE BAIXA SALINIDADE.
  - Desenvolver um projeto de Engenharia de Software que calcule a quantidade de partículas depositadas no meio poroso devido a migração de finos, utili- zando como dados/informações de referência os valores da literatura ou de experimentos laboratoriais, os quais serão inseridos pelo usuário por meio de arquivos .txt. Por meio do software será possível analisar o declínio de perme- abilidade, ou seja o dano à formação, devido a quantidade de partículas retidas no meio poroso e assim evitar prejuízos ecônomicos as indústrias petróliferas, pois será possível realizar uma análise e um estudo prévio do caso.
- Área:
  - Engenharia de reservatório.

** Título: ProjetoEngenharia-AplicacaoCorrelacoesCalculoParametrosReservartorioPropriedadesFluidos-Blackoil
- Link no github:
  - https://github.com/ldsc/ProjetoEngenharia-AplicacaoCorrelacoesCalculoParametrosReservartorioPropriedadesFluidos-Blackoil
- Resumo:
  - DESENVOLVIMENTO DO SOFTWARE APLICAÇÃO DE CORRELAÇÕES PARA CÁLCULO DE PARÂMETROS DE RESERVATÓRIO A PARTIR DE PROPRIEDADES DOS FLUIDOS – MODELAGEM BLACKOIL.
  - Utilizar correlações empı́ricas para cálculo de parâmetros de um reservatório a partir de propriedades dos fluidos presentes no mesmo – Modelagem BlackOil. – Calcular propriedades dos fluidos a partir de dados externos. – Calcular parâmetros de um reservatório utilizando correlações especı́ficas.
- Área:
  - Engenharia de reservatório.

** Título: ProjetoEngenharia-AutomacaoDaDefinicaoDoVolumeElementarRepresentativo
- Link no github:
  - https://github.com/ldsc/ProjetoEngenharia-AutomacaoDaDefinicaoDoVolumeElementarRepresentativo
- Resumo:
  - O PetroRev é um software desenvolvido em C++ que automatiza o processo de análise de Volume Elementar Representativo (REV) de amostras rochosas digitalizadas por microtomografia de raios X. Esse processo é crucial para determinar um volume estatisticamente representativo para simulações em escala de poros, especialmente focando na propriedade petrofísica da porosidade.
  - Pré-processamento de Imagens: Prepara as imagens de microtomografia para análise.
  - Segmentação e Identificação de Poros e Sólidos: Identifica áreas porosas e não porosas nas imagens.
  - Cálculo de Porosidade em Subamostras: Calcula a porosidade de subamostras para determinar o REV.
  - Análise Estatística para Identificação do REV: Utiliza dados de porosidade para determinar um volume representativo estatisticamente.
- Área:
  - Petrofísica.

** Título: ProjetoEngenharia-AvaliacaoCondicaoExperimentalSeparacaoComponentesDoPetroleoPorCromatografiaLiquida
- Link no github:
  - https://github.com/ldsc/ProjetoEngenharia-AvaliacaoCondicaoExperimentalSeparacaoComponentesDoPetroleoPorCromatografiaLiquida
- Resumo:
  - Em desenvolvimento.
- Área:
  - Geoquímica.

