README.html

<div id="outline-container-orged5791c" class="outline-3">
<h3 id="orged5791c"><span class="section-number-3">12.6.</span> Título: ProjetoEngenharia-STC-3D-SimuladorDeTransferenciaDeCalor-3D</h3>
<div class="outline-text-3" id="text-12-6">
<ul class="org-ul">
<li>Link no github:
<ul class="org-ul">
<li><a href="https://github.com/ldsc/ProjetoEngenharia-STC-3D-SimuladorDeTransferenciaDeCalor-3D">https://github.com/ldsc/ProjetoEngenharia-STC-3D-SimuladorDeTransferenciaDeCalor-3D</a></li>
</ul></li>
<li>Resumo:
<ul class="org-ul">
<li>Projeto de engenharia - Simulador de condução térmica em objetos 3D com perfis genéricos.</li>
<li>O seguinte projeto de engenharia deve simular a difusão térmica de qualquer objeto tridimensional, onde o usuário desenha a superfície de alguns perfis e escolhe as temperaturas e suas propriedades termofísicas.</li>
<li>A equação do Calor será modelada por diferenças finitas pelo modelo BTCS, utilizando fronteiras de Neumann, e a programação utilizará paralelismo e multithreading para acelerar as simulações.</li>
<li>No quesito prático, o usuário poderá desenhar a superfície a ser simulada, escolher sua temperatura, propriedades termofísicas e se é fonte/sumidouro ou não. Também terá a liberdade de escolher um ponto para analisar os gráficos da evolução térmica no tempo e espaço, salvar as superfícies dos perfis e carregar essas camadas com todas as suas propriedades e modificá-las. Por fim, o projeto será utilizado para estudar a injeção de calor em reservatórios 2D e 3D, e avaliar a distribuição da temperatura ao longo do tempo no reservatório.</li>
<li>Nota: Também foi o TCC do aluno Nikolas.</li>
</ul></li>
<li>Área:
<ul class="org-ul">
<li>Transferência de calor.</li>
</ul></li>
<li>Autor:
<ul class="org-ul">
<li>Nikolas Almeida Pinto.</li>
<li>Publicação:
<ul class="org-ul">
<li><a href="https://github.com/ldsc/ProjetoEngenharia-STC-3D-SimuladorDeTransferenciaDeCalor-3D/blob/master/doc/ManualTecnico/TCC-NikolasAlmeidaPinto.pdf">TCC</a></li>
<li><a href="https://github.com/ldsc/ProjetoEngenharia-STC-3D-SimuladorDeTransferenciaDeCalor-3D/blob/master/doc/ManualTecnico/Apresentacao_Nicholas_TCC2.pptx">Apresentacao</a></li>
</ul></li>
</ul></li>
<li></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org8770a8f" class="outline-2">
<h2 id="org8770a8f"><span class="section-number-2">13.</span> <a id="orgdab90f3"></a>Repositórios de projetos desenvolvidos</h2>
<div class="outline-text-2" id="text-13">
</div>
<div id="outline-container-org47b3f44" class="outline-3">
<h3 id="org47b3f44"><span class="section-number-3">13.1.</span> Título: ProjetoEngenharia-AnaliseDoEfeitoDePeliculaAPartirIPR-PocosVerticais-EscoamentoMonofasico</h3>
<div class="outline-text-3" id="text-13-1">
<ul class="org-ul">
<li>Link no github:
<ul class="org-ul">
<li><a href="https://github.com/ldsc/ProjetoEngenharia-AnaliseDoEfeitoDePeliculaAPartirIPR-PocosVerticais-EscoamentoMonofasico">https://github.com/ldsc/ProjetoEngenharia-AnaliseDoEfeitoDePeliculaAPartirIPR-PocosVerticais-EscoamentoMonofasico</a></li>
</ul></li>
<li>Resumo:
<ul class="org-ul">
<li>ANÁLISE DO EFEITO DE PELÍCULA A PARTIR DE CURVAS DE ÍNDICE DE PRODUTIVIDADE (IPR) PARA POÇOS VERTICAIS EM ESCOAMENTO MONOFÁSICO DE ÓLEO.</li>
<li>Utilizar equações propostas na literatura e em artigos cientı́ficos para o cálculo do efeito de pelı́cula total.</li>
<li>Plotar curvas de IPR para poços verticais em escoamento monofásico de óleo a partir de soluções analı́ticas da E.D.H. considerando regime transiente, pseu-do permanente e permanente a partir do software externo Gnuplot.</li>
</ul></li>
<li>Área:
<ul class="org-ul">
<li>Engenharia de reservatório.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org16b1896" class="outline-3">
<h3 id="org16b1896"><span class="section-number-3">13.2.</span> Título: ProjetoEngenharia-AnaliseQuedaPressaoDevidoMigracaoFinosOcasionadaInjecaoAguaBaixaSalinidade</h3>
<div class="outline-text-3" id="text-13-2">
<ul class="org-ul">
<li>Link no github:
<ul class="org-ul">
<li><a href="https://github.com/ldsc/ProjetoEngenharia-AnaliseQuedaPressaoDevidoMigracaoFinosOcasionadaInjecaoAguaBaixaSalinidade">https://github.com/ldsc/ProjetoEngenharia-AnaliseQuedaPressaoDevidoMigracaoFinosOcasionadaInjecaoAguaBaixaSalinidade</a></li>
</ul></li>
<li>Resumo:
<ul class="org-ul">
<li>ANÁLISE DA QUEDA DE PRESSÃO DEVIDO A MIGRAÇÃO DE FINOS OCASIONADA PELA INJEÇÃO DE ÁGUA DE BAIXA SALINIDADE.</li>
<li>Desenvolver um projeto de Engenharia de Software que calcule a quantidade de partículas depositadas no meio poroso devido a migração de finos, utili- zando como dados/informações de referência os valores da literatura ou de experimentos laboratoriais, os quais serão inseridos pelo usuário por meio de arquivos .txt. Por meio do software será possível analisar o declínio de perme- abilidade, ou seja o dano à formação, devido a quantidade de partículas retidas no meio poroso e assim evitar prejuízos ecônomicos as indústrias petróliferas, pois será possível realizar uma análise e um estudo prévio do caso.</li>
</ul></li>
<li>Área:
<ul class="org-ul">
<li>Engenharia de reservatório.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orge471005" class="outline-3">
<h3 id="orge471005"><span class="section-number-3">13.3.</span> Título: ProjetoEngenharia-AplicacaoCorrelacoesCalculoParametrosReservartorioPropriedadesFluidos-Blackoil</h3>
<div class="outline-text-3" id="text-13-3">
<ul class="org-ul">
<li>Link no github:
<ul class="org-ul">
<li><a href="https://github.com/ldsc/ProjetoEngenharia-AplicacaoCorrelacoesCalculoParametrosReservartorioPropriedadesFluidos-Blackoil">https://github.com/ldsc/ProjetoEngenharia-AplicacaoCorrelacoesCalculoParametrosReservartorioPropriedadesFluidos-Blackoil</a></li>
</ul></li>
<li>Resumo:
<ul class="org-ul">
<li>DESENVOLVIMENTO DO SOFTWARE APLICAÇÃO DE CORRELAÇÕES PARA CÁLCULO DE PARÂMETROS DE RESERVATÓRIO A PARTIR DE PROPRIEDADES DOS FLUIDOS – MODELAGEM BLACKOIL.</li>
<li>Utilizar correlações empı́ricas para cálculo de parâmetros de um reservatório a partir de propriedades dos fluidos presentes no mesmo – Modelagem BlackOil. – Calcular propriedades dos fluidos a partir de dados externos. – Calcular parâmetros de um reservatório utilizando correlações especı́ficas.</li>
</ul></li>
<li>Área:
<ul class="org-ul">
<li>Engenharia de reservatório.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org6b9a7fa" class="outline-3">
<h3 id="org6b9a7fa"><span class="section-number-3">13.4.</span> Título: ProjetoEngenharia-AutomacaoDaDefinicaoDoVolumeElementarRepresentativo</h3>
<div class="outline-text-3" id="text-13-4">
<ul class="org-ul">
<li>Link no github:
<ul class="org-ul">
<li><a href="https://github.com/ldsc/ProjetoEngenharia-AutomacaoDaDefinicaoDoVolumeElementarRepresentativo">https://github.com/ldsc/ProjetoEngenharia-AutomacaoDaDefinicaoDoVolumeElementarRepresentativo</a></li>
</ul></li>
<li>Resumo:
<ul class="org-ul">
<li>O PetroRev é um software desenvolvido em C++ que automatiza o processo de análise de Volume Elementar Representativo (REV) de amostras rochosas digitalizadas por microtomografia de raios X. Esse processo é crucial para determinar um volume estatisticamente representativo para simulações em escala de poros, especialmente focando na propriedade petrofísica da porosidade.</li>
<li>Pré-processamento de Imagens: Prepara as imagens de microtomografia para análise.</li>
<li>Segmentação e Identificação de Poros e Sólidos: Identifica áreas porosas e não porosas nas imagens.</li>
<li>Cálculo de Porosidade em Subamostras: Calcula a porosidade de subamostras para determinar o REV.</li>
<li>Análise Estatística para Identificação do REV: Utiliza dados de porosidade para determinar um volume representativo estatisticamente.</li>
</ul></li>
<li>Área:
<ul class="org-ul">
<li>Petrofísica.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org26e13cb" class="outline-3">
<h3 id="org26e13cb"><span class="section-number-3">13.5.</span> Título: ProjetoEngenharia-AvaliacaoCondicaoExperimentalSeparacaoComponentesDoPetroleoPorCromatografiaLiquida</h3>
<div class="outline-text-3" id="text-13-5">
<ul class="org-ul">
<li>Link no github:
<ul class="org-ul">
<li><a href="https://github.com/ldsc/ProjetoEngenharia-AvaliacaoCondicaoExperimentalSeparacaoComponentesDoPetroleoPorCromatografiaLiquida">https://github.com/ldsc/ProjetoEngenharia-AvaliacaoCondicaoExperimentalSeparacaoComponentesDoPetroleoPorCromatografiaLiquida</a></li>
</ul></li>
<li>Resumo:
<ul class="org-ul">
<li>Em desenvolvimento.</li>
</ul></li>
<li>Área:
<ul class="org-ul">
<li>Geoquímica.</li>
</ul></li>
</ul>
</div>
</div>
