README.org
** Título: ProjetoEngenharia-AvaliacaoDasCondicoesExperimentaisParaSeparacaoDeComponentesDoPetroleoPorCromatogr
- Link no github:
  - https://github.com/ldsc/ProjetoEngenharia-AvaliacaoDasCondicoesExperimentaisParaSeparacaoDeComponentesDoPetroleoPorCromatogr
- Resumo:
  - AVALIAÇÃO DAS CONDIÇÕES EXPERIMENTAIS PARA SEPARAÇÃO DE COMPONENTES DO PETRÓLEO POR CROMATOGRAFIA LÍQUIDA UTILIZANDO PLANEJAMENTO FATORIAL.
  - Determinar, a partir do planejamento fatorial com ponto central, as melhores condições experimentais para a obtenção da fração de hidrocarbonetos satura- dos do petróleo utilizando a técnica de cromatografia em fase líquida clássica em coluna aberta, visando diminuir a quantidade de solvente e adsorvente utilizado, aumentar a porcentagem de recuperação da fração e, como conse- quência, reduzir a quantidade de resíduos líquidos e sólidos gerados ao meio ambiente.
- Área:
  - Geoquímica.

** Título: ProjetoEngenharia-AvaliacaoFormacoesPorDadosDeTestesDePressao
- Link no github:
  - https://github.com/ldsc/ProjetoEngenharia-AvaliacaoFormacoesPorDadosDeTestesDePressao
- Resumo:
  - AVALIAÇÃO DE FORMAÇÕES POR DADOS DE TESTES DE PRESSÃO.
  - Criar um software capaz de fornecer ao usuário parâmetros e características do reservatório, através da análise dos dados obtidos em testes de pressão em poços, possibilitando estimar as dimensões do campo e sua potencialidade econômica.
- Área:
  - Engenharia de reservatório.

** Título: ProjetoEngenharia-BancoDeDadosFluidosPerfuracao
- Link no github:
  - https://github.com/ldsc/ProjetoEngenharia-BancoDeDadosFluidosPerfuracao
- Resumo:
  - BANCO DE DADOS DE FLUIDOS DE PERFURAÇÃO.
  - Desenvolver um banco de dados contendo informações a respeito defluidos de perfuração desenvolvidos no Laboratório de Fluidos do LENEP-Laboratório de Engenharia e Exploração de Petróleo.
- Área:
  - Engenharia de poço.

** Título: ProjetoEngenharia-CalculoDaTrajetoriaDirecionalParaperfuracaoDePocosDePetroleo-TIPO-1-BUILD-AND-HOLD
- Link no github:
  - https://github.com/ldsc/ProjetoEngenharia-CalculoDaTrajetoriaDirecionalParaperfuracaoDePocosDePetroleo-TIPO-1-BUILD-AND-HOLD
- Resumo:
  - CÁLCULO DE TRAJETÓRIA DIRECIONAL PARA PERFURAÇÃO DE POÇOS DE PETRÓLEO: TIPO 1 - BUILD AND HOLD.
  - Desenvolver uma solução para o cálculo da trajetória em 2D de um projeto de poço vertical e direcional.
- Área:
  - Engenharia de poço.

** Título: ProjetoEngenharia-CalculoDosFatoresDeRecuperacaoAvancadaDePetroleoAPartirDeTesteDeFluxoEmMeiosPoroso
- Link no github:
  - https://github.com/ldsc/ProjetoEngenharia-CalculoDosFatoresDeRecuperacaoAvancadaDePetroleoAPartirDeTesteDeFluxoEmMeiosPoroso
- Resumo:
  - CÁLCULO DOS FATORES DE RECUPERAÇÃO AVANÇADA DE PETROLEO À PARTIR DE TESTES DE FLUXO EM MEIO POROSO.
  - Calcular a permeabilidade absoluta de amostras rochosas;
  - Obter grfico da permeabilidade absoluta da amostra (plugs );
  - Calcular o volume poroso de amostras rochosas;
  - Calcular as frações de recuperação de óleo a partir do método utilizado: Secundário e/ou Avançado;
  - Possibilitar a inclusão de informações de novosfuidos e amostras (plugs );
  - Obter gráficos com as curvas de produção de água e de óleo através da recuperaçao secundária e avançada a partir da entrada de dados pelo usuário (volumes produzidos por minuto);
  - Obter as saturações iniciais e finais dos fluidos injetados no meio poroso;
  - Obter o fator de recuperação total de óleo através dos métodos de recuperação utilizados.
- Área:
  - Engenharia de reservatório.

** Título: ProjetoEngenharia-CalculoIndiceProdutividadePocos
- Link no github:
  - https://github.com/ldsc/ProjetoEngenharia-CalculoIndiceProdutividadePocos
- Resumo:
  - Desenvolver um projeto de engenharia de software para resolver os diferentes modelos matemáticos de previsão de produtividade de poços horizontais e ver- ticais e a influência dos parâmetros de reservatórios nos mesmos para analisar em que situações, em termos de produtividade, qual design de poço seria mais recomendado através das simulações.
- Área:
  - Engenharia de poço.

** Título: ProjetoEngenharia-CalculoPerdaCargaDistribuidaFluidoNoDecorrerEscoamento
- Link no github:
  - https://github.com/ldsc/ProjetoEngenharia-CalculoPerdaCargaDistribuidaFluidoNoDecorrerEscoamento
- Resumo:
  - CÁLCULO DA PERDA DE CARGA DISTRIBUIDA DE UM FLUIDO NO DECORRER DO ESCOAMENTO.
  - Desenvolver um projeto de engenharia de software para calcular a perda de carga distribuída de um fluido no decorrer do escoamento ao longo da tubulação.
- Área:
  - Engenharia de elevação e escoamento.
  - Engenharia de poço.

** Título: ProjetoEngenharia-CalculoVolumesFluidosPerfuracaoCimentacaoTubosETempoPerfuracao
- Link no github:
  - https://github.com/ldsc/ProjetoEngenharia-CalculoVolumesFluidosPerfuracaoCimentacaoTubosETempoPerfuracao
- Resumo:
  - Desenvolver um programa para cálculo dos volumes de fluido de perfuração e cimento, quantidade de tubos e o tempo gasto em uma operação de perfuração de um poço de petróleo.
- Área:
  - Engenharia de poço.

** Título: ProjetoEngenharia-CorrelacoesPVT
- Link no github:
  - https://github.com/ldsc/ProjetoEngenharia-CorrelacoesPVT
- Resumo:
  - Criar um banco virtual de correlações onde seja possível estimar diversas propriedades relacionadas ao gás e ao óleo presentes em um reservatório. Visando a empregá-lo no ensino e pesquisa.
- Área
  - Engenharia de reservatório.

