README.html

<div id="outline-container-orgec0a34e" class="outline-3">
<h3 id="orgec0a34e"><span class="section-number-3">13.6.</span> Título: ProjetoEngenharia-AvaliacaoDasCondicoesExperimentaisParaSeparacaoDeComponentesDoPetroleoPorCromatogr</h3>
<div class="outline-text-3" id="text-13-6">
<ul class="org-ul">
<li>Link no github:
<ul class="org-ul">
<li><a href="https://github.com/ldsc/ProjetoEngenharia-AvaliacaoDasCondicoesExperimentaisParaSeparacaoDeComponentesDoPetroleoPorCromatogr">https://github.com/ldsc/ProjetoEngenharia-AvaliacaoDasCondicoesExperimentaisParaSeparacaoDeComponentesDoPetroleoPorCromatogr</a></li>
</ul></li>
<li>Resumo:
<ul class="org-ul">
<li>AVALIAÇÃO DAS CONDIÇÕES EXPERIMENTAIS PARA SEPARAÇÃO DE COMPONENTES DO PETRÓLEO POR CROMATOGRAFIA LÍQUIDA UTILIZANDO PLANEJAMENTO FATORIAL.</li>
<li>Determinar, a partir do planejamento fatorial com ponto central, as melhores condições experimentais para a obtenção da fração de hidrocarbonetos satura- dos do petróleo utilizando a técnica de cromatografia em fase líquida clássica em coluna aberta, visando diminuir a quantidade de solvente e adsorvente utilizado, aumentar a porcentagem de recuperação da fração e, como conse- quência, reduzir a quantidade de resíduos líquidos e sólidos gerados ao meio ambiente.</li>
</ul></li>
<li>Área:
<ul class="org-ul">
<li>Geoquímica.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org73d7bd0" class="outline-3">
<h3 id="org73d7bd0"><span class="section-number-3">13.7.</span> Título: ProjetoEngenharia-AvaliacaoFormacoesPorDadosDeTestesDePressao</h3>
<div class="outline-text-3" id="text-13-7">
<ul class="org-ul">
<li>Link no github:
<ul class="org-ul">
<li><a href="https://github.com/ldsc/ProjetoEngenharia-AvaliacaoFormacoesPorDadosDeTestesDePressao">https://github.com/ldsc/ProjetoEngenharia-AvaliacaoFormacoesPorDadosDeTestesDePressao</a></li>
</ul></li>
<li>Resumo:
<ul class="org-ul">
<li>AVALIAÇÃO DE FORMAÇÕES POR DADOS DE TESTES DE PRESSÃO.</li>
<li>Criar um software capaz de fornecer ao usuário parâmetros e características do reservatório, através da análise dos dados obtidos em testes de pressão em poços, possibilitando estimar as dimensões do campo e sua potencialidade econômica.</li>
</ul></li>
<li>Área:
<ul class="org-ul">
<li>Engenharia de reservatório.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgf94bd02" class="outline-3">
<h3 id="orgf94bd02"><span class="section-number-3">13.8.</span> Título: ProjetoEngenharia-BancoDeDadosFluidosPerfuracao</h3>
<div class="outline-text-3" id="text-13-8">
<ul class="org-ul">
<li>Link no github:
<ul class="org-ul">
<li><a href="https://github.com/ldsc/ProjetoEngenharia-BancoDeDadosFluidosPerfuracao">https://github.com/ldsc/ProjetoEngenharia-BancoDeDadosFluidosPerfuracao</a></li>
</ul></li>
<li>Resumo:
<ul class="org-ul">
<li>BANCO DE DADOS DE FLUIDOS DE PERFURAÇÃO.</li>
<li>Desenvolver um banco de dados contendo informações a respeito defluidos de perfuração desenvolvidos no Laboratório de Fluidos do LENEP-Laboratório de Engenharia e Exploração de Petróleo.</li>
</ul></li>
<li>Área:
<ul class="org-ul">
<li>Engenharia de poço.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgc1db4a3" class="outline-3">
<h3 id="orgc1db4a3"><span class="section-number-3">13.9.</span> Título: ProjetoEngenharia-CalculoDaTrajetoriaDirecionalParaperfuracaoDePocosDePetroleo-TIPO-1-BUILD-AND-HOLD</h3>
<div class="outline-text-3" id="text-13-9">
<ul class="org-ul">
<li>Link no github:
<ul class="org-ul">
<li><a href="https://github.com/ldsc/ProjetoEngenharia-CalculoDaTrajetoriaDirecionalParaperfuracaoDePocosDePetroleo-TIPO-1-BUILD-AND-HOLD">https://github.com/ldsc/ProjetoEngenharia-CalculoDaTrajetoriaDirecionalParaperfuracaoDePocosDePetroleo-TIPO-1-BUILD-AND-HOLD</a></li>
</ul></li>
<li>Resumo:
<ul class="org-ul">
<li>CÁLCULO DE TRAJETÓRIA DIRECIONAL PARA PERFURAÇÃO DE POÇOS DE PETRÓLEO: TIPO 1 - BUILD AND HOLD.</li>
<li>Desenvolver uma solução para o cálculo da trajetória em 2D de um projeto de poço vertical e direcional.</li>
</ul></li>
<li>Área:
<ul class="org-ul">
<li>Engenharia de poço.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org0715c49" class="outline-3">
<h3 id="org0715c49"><span class="section-number-3">13.10.</span> Título: ProjetoEngenharia-CalculoDosFatoresDeRecuperacaoAvancadaDePetroleoAPartirDeTesteDeFluxoEmMeiosPoroso</h3>
<div class="outline-text-3" id="text-13-10">
<ul class="org-ul">
<li>Link no github:
<ul class="org-ul">
<li><a href="https://github.com/ldsc/ProjetoEngenharia-CalculoDosFatoresDeRecuperacaoAvancadaDePetroleoAPartirDeTesteDeFluxoEmMeiosPoroso">https://github.com/ldsc/ProjetoEngenharia-CalculoDosFatoresDeRecuperacaoAvancadaDePetroleoAPartirDeTesteDeFluxoEmMeiosPoroso</a></li>
</ul></li>
<li>Resumo:
<ul class="org-ul">
<li>CÁLCULO DOS FATORES DE RECUPERAÇÃO AVANÇADA DE PETROLEO À PARTIR DE TESTES DE FLUXO EM MEIO POROSO.</li>
<li>Calcular a permeabilidade absoluta de amostras rochosas;</li>
<li>Obter grfico da permeabilidade absoluta da amostra (plugs );</li>
<li>Calcular o volume poroso de amostras rochosas;</li>
<li>Calcular as frações de recuperação de óleo a partir do método utilizado: Secundário e/ou Avançado;</li>
<li>Possibilitar a inclusão de informações de novosfuidos e amostras (plugs );</li>
<li>Obter gráficos com as curvas de produção de água e de óleo através da recuperaçao secundária e avançada a partir da entrada de dados pelo usuário (volumes produzidos por minuto);</li>
<li>Obter as saturações iniciais e finais dos fluidos injetados no meio poroso;</li>
<li>Obter o fator de recuperação total de óleo através dos métodos de recuperação utilizados.</li>
</ul></li>
<li>Área:
<ul class="org-ul">
<li>Engenharia de reservatório.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org17cc19f" class="outline-3">
<h3 id="org17cc19f"><span class="section-number-3">13.11.</span> Título: ProjetoEngenharia-CalculoIndiceProdutividadePocos</h3>
<div class="outline-text-3" id="text-13-11">
<ul class="org-ul">
<li>Link no github:
<ul class="org-ul">
<li><a href="https://github.com/ldsc/ProjetoEngenharia-CalculoIndiceProdutividadePocos">https://github.com/ldsc/ProjetoEngenharia-CalculoIndiceProdutividadePocos</a></li>
</ul></li>
<li>Resumo:
<ul class="org-ul">
<li>Desenvolver um projeto de engenharia de software para resolver os diferentes modelos matemáticos de previsão de produtividade de poços horizontais e ver- ticais e a influência dos parâmetros de reservatórios nos mesmos para analisar em que situações, em termos de produtividade, qual design de poço seria mais recomendado através das simulações.</li>
</ul></li>
<li>Área:
<ul class="org-ul">
<li>Engenharia de poço.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgacbba61" class="outline-3">
<h3 id="orgacbba61"><span class="section-number-3">13.12.</span> Título: ProjetoEngenharia-CalculoPerdaCargaDistribuidaFluidoNoDecorrerEscoamento</h3>
<div class="outline-text-3" id="text-13-12">
<ul class="org-ul">
<li>Link no github:
<ul class="org-ul">
<li><a href="https://github.com/ldsc/ProjetoEngenharia-CalculoPerdaCargaDistribuidaFluidoNoDecorrerEscoamento">https://github.com/ldsc/ProjetoEngenharia-CalculoPerdaCargaDistribuidaFluidoNoDecorrerEscoamento</a></li>
</ul></li>
<li>Resumo:
<ul class="org-ul">
<li>CÁLCULO DA PERDA DE CARGA DISTRIBUIDA DE UM FLUIDO NO DECORRER DO ESCOAMENTO.</li>
<li>Desenvolver um projeto de engenharia de software para calcular a perda de carga distribuída de um fluido no decorrer do escoamento ao longo da tubulação.</li>
</ul></li>
<li>Área:
<ul class="org-ul">
<li>Engenharia de elevação e escoamento.</li>
<li>Engenharia de poço.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org6138ab6" class="outline-3">
<h3 id="org6138ab6"><span class="section-number-3">13.13.</span> Título: ProjetoEngenharia-CalculoVolumesFluidosPerfuracaoCimentacaoTubosETempoPerfuracao</h3>
<div class="outline-text-3" id="text-13-13">
<ul class="org-ul">
<li>Link no github:
<ul class="org-ul">
<li><a href="https://github.com/ldsc/ProjetoEngenharia-CalculoVolumesFluidosPerfuracaoCimentacaoTubosETempoPerfuracao">https://github.com/ldsc/ProjetoEngenharia-CalculoVolumesFluidosPerfuracaoCimentacaoTubosETempoPerfuracao</a></li>
</ul></li>
<li>Resumo:
<ul class="org-ul">
<li>Desenvolver um programa para cálculo dos volumes de fluido de perfuração e cimento, quantidade de tubos e o tempo gasto em uma operação de perfuração de um poço de petróleo.</li>
</ul></li>
<li>Área:
<ul class="org-ul">
<li>Engenharia de poço.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org9b635e6" class="outline-3">
<h3 id="org9b635e6"><span class="section-number-3">13.14.</span> Título: ProjetoEngenharia-CorrelacoesPVT</h3>
<div class="outline-text-3" id="text-13-14">
<ul class="org-ul">
<li>Link no github:
<ul class="org-ul">
<li><a href="https://github.com/ldsc/ProjetoEngenharia-CorrelacoesPVT">https://github.com/ldsc/ProjetoEngenharia-CorrelacoesPVT</a></li>
</ul></li>
<li>Resumo:
<ul class="org-ul">
<li>Criar um banco virtual de correlações onde seja possível estimar diversas propriedades relacionadas ao gás e ao óleo presentes em um reservatório. Visando a empregá-lo no ensino e pesquisa.</li>
</ul></li>
<li>Área
<ul class="org-ul">
<li>Engenharia de reservatório.</li>
</ul></li>
</ul>
</div>
</div>
