README.org
** Título: ProjetoEngenharia-ESPPERFORMANCE-SimuladorDeCurvasDeDesempenhoDe-BCS-HEAD-ePerdasCarga
- Link no github:
  - https://github.com/ldsc/ProjetoEngenharia-ESPPERFORMANCE-SimuladorDeCurvasDeDesempenhoDe-BCS-HEAD-ePerdasCarga
- Resumo:
  - ESPPERFORMANCE - SIMULADOR DE CURVAS DE DESEMPENHO DE BCS: HEAD E PERDAS DE CARGA.
  - Desenvolver um simulador que calcule as curvas de perfomance de operação de BCS utilizado em elevação artficial de petróleo a partir de parametrizações para escoamento defluidos em bombas centrífugas.
- Área:
  - Engenharia de elevação e escoamento.

** Título: ProjetoEngenharia-FluxoMonofasicoReativoEmMeiosPorosos
- Link no github:
  - https://github.com/ldsc/ProjetoEngenharia-FluxoMonofasicoReativoEmMeiosPorosos
- Resumo:
  - Em desenvolvimento.
- Área:
  - Engenharia de reservatório.

** Título: ProjetoEngenharia-ModelosDeAquiferosAnaliticos
- Link no github:
  - https://github.com/ldsc/ProjetoEngenharia-ModelosDeAquiferosAnaliticos
- Resumo:
  - MODELOS DE AQUÍFEROS ANALÍTICOS.
  - No ambiente da Engenharia de Reservatórios, o objeto de estudo é o próprio reservatório de óleo e gás. No entanto, para que esse estudo ocorra de forma eficiente, é necessário que se entenda as características (porosidade, permeabilidade, volume de reservatório, presença e propriedades de aquíferos) e o comportamento sob produção. O objetivo de estudo deste software é analisar aquíferos analíticos com modelos distintos e como sua presença provoca efeitos em reservatórios de óleo e gás.
- Área:
  - Engenharia de reservatório.

** Título: ProjetoEngenharia-ModelosDeDeslocamentoImiscivelParaRecuperacaoSecundariaDePetroleo
- Link no github:
  - https://github.com/ldsc/ProjetoEngenharia-ModelosDeDeslocamentoImiscivelParaRecuperacaoSecundariaDePetroleo
- Resumo:
  - MODELOS DE DESLOCAMENTO IMISCÍVEL PARA RECUPERAÇÃO SECUNDÁRIA DE PETRÓLEO.
  - O projeto a ser desenvolvido consiste em um programa que calculará características de um reservatório homogêneo a partir de um fluxo bifásico areal, preverá o desempenho no processo de recuperação secundária do óleo a partir de um sistema estratificado com fluxo bifásico. A presente construção do sistema será utilizado em âmbito acadêmico como software livre, a partir do uso da Programação Orientada a Objeto em C++ e software Gnuplot, para que esteja disponível de fácil acesso a todos. A interface selecionada para o programa é em modo texto, o usuário irá se relacionar a partir do uso do teclado, mouse e monitor em conjunto com a interface do sistema construído. Os dados de entrada, propriedades do reservatório, serão fornecidos em modo .xlsx, na qual poderá ser modificado pelo usuário com base nas informações do reservatório em questão, enquanto que os dados de saída serão em modo arquivo de texto .txt e imagem .png com base nos diferentes modelos de deslocamento possíveis do software.
- Área:
  - Engenharia de reservatório.

** Título: ProjetoEngenharia-PrevisaoComportamentoDeReservatoriosDeOleoComCapaDeGasOuGasEmSolucaoEOleo-GasComIn
- Link no github:
  - https://github.com/ldsc/ProjetoEngenharia-PrevisaoComportamentoDeReservatoriosDeOleoComCapaDeGasOuGasEmSolucaoEOleo-GasComIn
- Resumo:
  - PREVISÃO DE COMPORTAMENTO DE RESERVATÓRIOS DE ÓLEO COM CAPA DE GÁS OU GÁS EM SOLUÇÃO E ÓLEO & GÁS COM INFLUXO DE ÁGUA.
  - Desenvolver um software para determinar os parâmetros comportamentais de um reservatório de óleo com capa de gás para a caracterização desse reservatório por meio da análise e cálculos a partir de dados de produção.
- Área:
  - Engenharia de reservatório.

** Título: ProjetoEngenharia-PropriedadesFisicasRochasSedimentaresUtilizandoDadosObtidosPorAnaliseDeImagens
- Link no github:
  - https://github.com/ldsc/ProjetoEngenharia-PropriedadesFisicasRochasSedimentaresUtilizandoDadosObtidosPorAnaliseDeImagens
- Resumo:
  - DETERMINAÇÃO DE PROPRIEDADES FÍSICAS DE ROCHAS SEDIMENTARES UTILIZANDO DADOS OBTIDOS POR ANÁLISE DE IMAGENS DIGITAIS.
  - Desenvolver um software que receba dados obtidos do ImageJ e converta-os em caracterização da rocha em análise.
  - As novas atualizações foram a inclusão de classes como: Analise porosidade, Parametros Morfometricos, Propriedades rocha (homogeneidade e heterogeneidade), Metodo RbSr, Volume representativo do elemento (REV) e SimulacaoFluxoFluidos (liquido e gasoso).
- Área:
  - Petrofísica.

** Título: ProjetoEngenharia-SimulacaoDeCurvasIPRUtilizandoModelosEmpiricosEmPocosVerticais
- Link no github:
  - https://github.com/ldsc/ProjetoEngenharia-SimulacaoDeCurvasIPRUtilizandoModelosEmpiricosEmPocosVerticais
- Resumo:
  - SIMULADOR DE CURVAS IPR UTILIZANDO MODELOS EMPÍRICOS EM POCOS VERTICAIS.
  - Selecionar o tipo de fluido e geometria do reservatório.
  - Desenvolver os cálculos das vazões e pressões com base nos modelos empíricos (Fetkovich, Vogel, Vogel Generalizada e Linear). – Plotar gráficos e permitir que possam ser salvos. – Permitir que o usuário possa entrar com os dados por meio de um arquivo de disco.
- Área:
  - Engenharia de reservatório.

** Título: ProjetoEngenharia-SimulacaoPropriedadesTermodinamicasSubstanciasSimplesECompostas
- Link no github:
  - https://github.com/ldsc/ProjetoEngenharia-SimulacaoPropriedadesTermodinamicasSubstanciasSimplesECompostas
- Resumo:
  - SIMULAÇÃO DE PROPRIEDADES TERMODINÂMICAS DE SUBSTÂNCIAS SIMPLES E COMPOSTAS.
  - bter propriedades termodinâmicas de substâncias simples e misturas de substâncias. Estas propriedades incluem fugacidade, densidade, volume específico, volume molar, e o fator de compressibilidade, tanto da fase líquida, quanto da fase vapor (se as duas coexistirem).
- Área:
  - Engenharia de reservatório.

