README.html

<div id="outline-container-org8bff0f4" class="outline-3">
<h3 id="org8bff0f4"><span class="section-number-3">13.15.</span> Título: ProjetoEngenharia-ESPPERFORMANCE-SimuladorDeCurvasDeDesempenhoDe-BCS-HEAD-ePerdasCarga</h3>
<div class="outline-text-3" id="text-13-15">
<ul class="org-ul">
<li>Link no github:
<ul class="org-ul">
<li><a href="https://github.com/ldsc/ProjetoEngenharia-ESPPERFORMANCE-SimuladorDeCurvasDeDesempenhoDe-BCS-HEAD-ePerdasCarga">https://github.com/ldsc/ProjetoEngenharia-ESPPERFORMANCE-SimuladorDeCurvasDeDesempenhoDe-BCS-HEAD-ePerdasCarga</a></li>
</ul></li>
<li>Resumo:
<ul class="org-ul">
<li>ESPPERFORMANCE - SIMULADOR DE CURVAS DE DESEMPENHO DE BCS: HEAD E PERDAS DE CARGA.</li>
<li>Desenvolver um simulador que calcule as curvas de perfomance de operação de BCS utilizado em elevação artficial de petróleo a partir de parametrizações para escoamento defluidos em bombas centrífugas.</li>
</ul></li>
<li>Área:
<ul class="org-ul">
<li>Engenharia de elevação e escoamento.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org9f5933b" class="outline-3">
<h3 id="org9f5933b"><span class="section-number-3">13.16.</span> Título: ProjetoEngenharia-FluxoMonofasicoReativoEmMeiosPorosos</h3>
<div class="outline-text-3" id="text-13-16">
<ul class="org-ul">
<li>Link no github:
<ul class="org-ul">
<li><a href="https://github.com/ldsc/ProjetoEngenharia-FluxoMonofasicoReativoEmMeiosPorosos">https://github.com/ldsc/ProjetoEngenharia-FluxoMonofasicoReativoEmMeiosPorosos</a></li>
</ul></li>
<li>Resumo:
<ul class="org-ul">
<li>Em desenvolvimento.</li>
</ul></li>
<li>Área:
<ul class="org-ul">
<li>Engenharia de reservatório.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org049fe3e" class="outline-3">
<h3 id="org049fe3e"><span class="section-number-3">13.17.</span> Título: ProjetoEngenharia-ModelosDeAquiferosAnaliticos</h3>
<div class="outline-text-3" id="text-13-17">
<ul class="org-ul">
<li>Link no github:
<ul class="org-ul">
<li><a href="https://github.com/ldsc/ProjetoEngenharia-ModelosDeAquiferosAnaliticos">https://github.com/ldsc/ProjetoEngenharia-ModelosDeAquiferosAnaliticos</a></li>
</ul></li>
<li>Resumo:
<ul class="org-ul">
<li>MODELOS DE AQUÍFEROS ANALÍTICOS.</li>
<li>No ambiente da Engenharia de Reservatórios, o objeto de estudo é o próprio reservatório de óleo e gás. No entanto, para que esse estudo ocorra de forma eficiente, é necessário que se entenda as características (porosidade, permeabilidade, volume de reservatório, presença e propriedades de aquíferos) e o comportamento sob produção. O objetivo de estudo deste software é analisar aquíferos analíticos com modelos distintos e como sua presença provoca efeitos em reservatórios de óleo e gás.</li>
</ul></li>
<li>Área:
<ul class="org-ul">
<li>Engenharia de reservatório.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org3669c99" class="outline-3">
<h3 id="org3669c99"><span class="section-number-3">13.18.</span> Título: ProjetoEngenharia-ModelosDeDeslocamentoImiscivelParaRecuperacaoSecundariaDePetroleo</h3>
<div class="outline-text-3" id="text-13-18">
<ul class="org-ul">
<li>Link no github:
<ul class="org-ul">
<li><a href="https://github.com/ldsc/ProjetoEngenharia-ModelosDeDeslocamentoImiscivelParaRecuperacaoSecundariaDePetroleo">https://github.com/ldsc/ProjetoEngenharia-ModelosDeDeslocamentoImiscivelParaRecuperacaoSecundariaDePetroleo</a></li>
</ul></li>
<li>Resumo:
<ul class="org-ul">
<li>MODELOS DE DESLOCAMENTO IMISCÍVEL PARA RECUPERAÇÃO SECUNDÁRIA DE PETRÓLEO.</li>
<li>O projeto a ser desenvolvido consiste em um programa que calculará características de um reservatório homogêneo a partir de um fluxo bifásico areal, preverá o desempenho no processo de recuperação secundária do óleo a partir de um sistema estratificado com fluxo bifásico. A presente construção do sistema será utilizado em âmbito acadêmico como software livre, a partir do uso da Programação Orientada a Objeto em C++ e software Gnuplot, para que esteja disponível de fácil acesso a todos. A interface selecionada para o programa é em modo texto, o usuário irá se relacionar a partir do uso do teclado, mouse e monitor em conjunto com a interface do sistema construído. Os dados de entrada, propriedades do reservatório, serão fornecidos em modo .xlsx, na qual poderá ser modificado pelo usuário com base nas informações do reservatório em questão, enquanto que os dados de saída serão em modo arquivo de texto .txt e imagem .png com base nos diferentes modelos de deslocamento possíveis do software.</li>
</ul></li>
<li>Área:
<ul class="org-ul">
<li>Engenharia de reservatório.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org63bf2a2" class="outline-3">
<h3 id="org63bf2a2"><span class="section-number-3">13.19.</span> Título: ProjetoEngenharia-PrevisaoComportamentoDeReservatoriosDeOleoComCapaDeGasOuGasEmSolucaoEOleo-GasComIn</h3>
<div class="outline-text-3" id="text-13-19">
<ul class="org-ul">
<li>Link no github:
<ul class="org-ul">
<li><a href="https://github.com/ldsc/ProjetoEngenharia-PrevisaoComportamentoDeReservatoriosDeOleoComCapaDeGasOuGasEmSolucaoEOleo-GasComIn">https://github.com/ldsc/ProjetoEngenharia-PrevisaoComportamentoDeReservatoriosDeOleoComCapaDeGasOuGasEmSolucaoEOleo-GasComIn</a></li>
</ul></li>
<li>Resumo:
<ul class="org-ul">
<li>PREVISÃO DE COMPORTAMENTO DE RESERVATÓRIOS DE ÓLEO COM CAPA DE GÁS OU GÁS EM SOLUÇÃO E ÓLEO &amp; GÁS COM INFLUXO DE ÁGUA.</li>
<li>Desenvolver um software para determinar os parâmetros comportamentais de um reservatório de óleo com capa de gás para a caracterização desse reservatório por meio da análise e cálculos a partir de dados de produção.</li>
</ul></li>
<li>Área:
<ul class="org-ul">
<li>Engenharia de reservatório.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org4238522" class="outline-3">
<h3 id="org4238522"><span class="section-number-3">13.20.</span> Título: ProjetoEngenharia-PropriedadesFisicasRochasSedimentaresUtilizandoDadosObtidosPorAnaliseDeImagens</h3>
<div class="outline-text-3" id="text-13-20">
<ul class="org-ul">
<li>Link no github:
<ul class="org-ul">
<li><a href="https://github.com/ldsc/ProjetoEngenharia-PropriedadesFisicasRochasSedimentaresUtilizandoDadosObtidosPorAnaliseDeImagens">https://github.com/ldsc/ProjetoEngenharia-PropriedadesFisicasRochasSedimentaresUtilizandoDadosObtidosPorAnaliseDeImagens</a></li>
</ul></li>
<li>Resumo:
<ul class="org-ul">
<li>DETERMINAÇÃO DE PROPRIEDADES FÍSICAS DE ROCHAS SEDIMENTARES UTILIZANDO DADOS OBTIDOS POR ANÁLISE DE IMAGENS DIGITAIS.</li>
<li>Desenvolver um software que receba dados obtidos do ImageJ e converta-os em caracterização da rocha em análise.</li>
<li>As novas atualizações foram a inclusão de classes como: Analise porosidade, Parametros Morfometricos, Propriedades rocha (homogeneidade e heterogeneidade), Metodo RbSr, Volume representativo do elemento (REV) e SimulacaoFluxoFluidos (liquido e gasoso).</li>
</ul></li>
<li>Área:
<ul class="org-ul">
<li>Petrofísica.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org7aefa29" class="outline-3">
<h3 id="org7aefa29"><span class="section-number-3">13.21.</span> Título: ProjetoEngenharia-SimulacaoDeCurvasIPRUtilizandoModelosEmpiricosEmPocosVerticais</h3>
<div class="outline-text-3" id="text-13-21">
<ul class="org-ul">
<li>Link no github:
<ul class="org-ul">
<li><a href="https://github.com/ldsc/ProjetoEngenharia-SimulacaoDeCurvasIPRUtilizandoModelosEmpiricosEmPocosVerticais">https://github.com/ldsc/ProjetoEngenharia-SimulacaoDeCurvasIPRUtilizandoModelosEmpiricosEmPocosVerticais</a></li>
</ul></li>
<li>Resumo:
<ul class="org-ul">
<li>SIMULADOR DE CURVAS IPR UTILIZANDO MODELOS EMPÍRICOS EM POCOS VERTICAIS.</li>
<li>Selecionar o tipo de fluido e geometria do reservatório.</li>
<li>Desenvolver os cálculos das vazões e pressões com base nos modelos empíricos (Fetkovich, Vogel, Vogel Generalizada e Linear). – Plotar gráficos e permitir que possam ser salvos. – Permitir que o usuário possa entrar com os dados por meio de um arquivo de disco.</li>
</ul></li>
<li>Área:
<ul class="org-ul">
<li>Engenharia de reservatório.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org8c865fb" class="outline-3">
<h3 id="org8c865fb"><span class="section-number-3">13.22.</span> Título: ProjetoEngenharia-SimulacaoPropriedadesTermodinamicasSubstanciasSimplesECompostas</h3>
<div class="outline-text-3" id="text-13-22">
<ul class="org-ul">
<li>Link no github:
<ul class="org-ul">
<li><a href="https://github.com/ldsc/ProjetoEngenharia-SimulacaoPropriedadesTermodinamicasSubstanciasSimplesECompostas">https://github.com/ldsc/ProjetoEngenharia-SimulacaoPropriedadesTermodinamicasSubstanciasSimplesECompostas</a></li>
</ul></li>
<li>Resumo:
<ul class="org-ul">
<li>SIMULAÇÃO DE PROPRIEDADES TERMODINÂMICAS DE SUBSTÂNCIAS SIMPLES E COMPOSTAS.</li>
<li>bter propriedades termodinâmicas de substâncias simples e misturas de substâncias. Estas propriedades incluem fugacidade, densidade, volume específico, volume molar, e o fator de compressibilidade, tanto da fase líquida, quanto da fase vapor (se as duas coexistirem).</li>
</ul></li>
<li>Área:
<ul class="org-ul">
<li>Engenharia de reservatório.</li>
</ul></li>
</ul>
</div>
</div>
