README.org
** Título: ProjetoEngenharia-SimuladorDeEstimativaDeReservaUtilizandoEBM-EnfoqueReservatoriosGas
- Link no github:
  - https://github.com/ldsc/ProjetoEngenharia-SimuladorDeEstimativaDeReservaUtilizandoEBM-EnfoqueReservatoriosGas
- Resumo:
  - SIMULADOR DE ESTIMATIVA DE RESERVA DE RESERVATÓRIO UTILIZANDO EBM, COM ENFOQUE NOS RESERVATÓRIOS DE GÁS.
  - Aperfeiçoar a solução para determinar o volume original de fluido (principalmente gás) no reservatório, incluindo a modelagem de diferentes mecanismos de produção e a injeção de fluidos.
  - Implementar classes e métodos para representar a injeção de água, gás, polímero, surfactante, vapor e gás lift no reservatório.
  - Aprimorar a flexibilidade do programa para lidar com uma variedade de cenários de produção e injeção.
  - Refinar a lógica de cálculo do volume original de fluido para considerar os efeitos das novas classes de injeção.
- Área:
  - Engenharia de reservatório.

** Título: ProjetoEngenharia-SimuladorDeReservatorioMonofasico2D
- Link no github:
  - https://github.com/ldsc/ProjetoEngenharia-SimuladorDeReservatorioMonofasico2D
- Resumo:
  - SIMULADOR DE RESERVATÓRIO MONOFÁSICO 2D.
- Área:
  - Engenharia de reservatório.

** Título: ProjetoEngenharia-SimuladorDeTracoSismico
- Link no github:
  - https://github.com/ldsc/ProjetoEngenharia-SimuladorDeTracoSismico
- Resumo:
  - Desenvolver um programa para a gerar um traço sísmico sintético de uma formação arbitrária a partir de dados da formação com espessura da camada, velocidade de propagação da onda acústica e a densidade.
- Área:
  - Geofísica.

** Título: ProjetoEngenharia-SimuladorHidraulicaPerfuracaoPoco
- Link no github:
  - https://github.com/ldsc/ProjetoEngenharia-SimuladorHidraulicaPerfuracaoPoco
- Resumo:
  - Desenvolver um simulador de hidráulica de poço que execute cálculos e gere gráficos. Para tal, deve-se usar as equações de perda de carga provenientes da mecânica dos fluidos adaptadas à indústria do petróleo.
- Área:
  - Engenharia de reservatório.

** Título: ProjetoEngenharia-SimuladorPropriedadesMaterialSubmetidoCorrosaoPorDioxidoDeCarbono
- Link no github:
  - https://github.com/ldsc/ProjetoEngenharia-SimuladorPropriedadesMaterialSubmetidoCorrosaoPorDioxidoDeCarbono
- Resumo:
  - Simulador de Propriedades Mecânicas de Material Submetido ao Processo de Corrosão por Dióxido de Carbono. Desenvolver um programa que receba dados reais ou arbitrários e calcule as propriedades mecânicas do material a partir de onde serão gerados gráficos que poderão ser utilizados para análise de taxas corrosivas.
- Área:
  - Corrosão.

** Título: rojetoEngenharia-SimuladorReservatorio2D
- Link no github:
  - https://github.com/ldsc/ProjetoEngenharia-SimuladorReservatorio2D
- Resumo:
  - Em desenvolvimento.
  - Criar um software capaz de fornecer ao usuário parâmetros e características do reservatório, através da análise dos dados obtidos em testes de pressão em poços, possibilitando estimar as dimensões do campo e sua potencialidade econômica.
  - Nota: Continuidade do projeto: https://github.com/ldsc/ProjetoEngenharia-SimuladorDeReservatorioMonofasico2D
- Área:
  - Engenharia de reservatório.

** Título: ProjetoEngenharia-SimuladorSolucoesAnaliticasAdmensionaisEqDifusividadeHidraulicaFluxosLinearERadial
- Link no github:
  - https://github.com/ldsc/ProjetoEngenharia-SimuladorSolucoesAnaliticasAdmensionaisEqDifusividadeHidraulicaFluxosLinearERadial
- Resumo:
  - SIMULADOR DE SOLUÇÕES ANALÍTICAS ADIMENSIONAIS DA EQUAÇÃO DA DIFUSIVIDADE HIDRÁULICA PARA FLUXOS LINEAR E RADIAL.
  - A partir da descoberta de uma acumulação de petróleo diversas informações podem ser obtidas. Das mais importantes, pode-se citar como exemplo a quantidade de hidro- carbonetos que se pode retirar dessa jazida e o tempo em que essa produção se efetuará. Dentro da engenharia de petróleo, engenheiros de reservatório constantemente buscam solucionar problemas envolvendo fluxos monofásicos de fluidos de baixa compressibilidade que partem das as equações fundamentais da mecânica dos fluidos que descrevem o trans- porte de líquidos em meios porosos. A principal equação que rege esse estudo do fluxo em meios porosos é a Equação da Difusividade Hidráulica e ao resolver os problemas de valor inicial e de contorno formados por essa equação, é possível obter os modelos físicos de interesse que são encontrados no campo. A necessidade de monitoramento do comportamento do reservatório é evidente e prever como será o seu comportamento auxilia diretamente na tomada de decisões a respeito das operações realizadas e serve de base para os testes de pressão que visam a obtenção de vários parâmetros do reservatório (fator de película, volume poroso drenado, limites do reservatório, etc).
- Área:
  - Engenharia de reservatório.

** Título: ProjetoEngenharia-SimuladorSubstituicaoFluidoEmodelagemAVO
- Link no github:
  - https://github.com/ldsc/ProjetoEngenharia-SimuladorSubstituicaoFluidoEmodelagemAVO
- Resumo:
  - DESENVOLVIMENTO DO SOFTWARE SIMULADOR DE SUBSTITUIÇÃO DE FLUIDOS E DE MODELAGEM AVO.
  - Realizar a substituição de fluidos para plotar um gráfico de velocidade da onda compressional pela saturação de água e de velocidade da onda cisalhante pela saturação de água.
- Área:
  - Geofísica

** Título: ProjetoEngenharia-SoftwareCaracterizacaoDeReservatoriosIntegradoAAnalisePetrofisica
- Link no github:
  - https://github.com/ldsc/ProjetoEngenharia-SoftwareCaracterizacaoDeReservatoriosIntegradoAAnalisePetrofisica
- Resumo:
  - DESENVOLVIMENTO DO SOFTWARE CARACTERIZAÇÃO DE RESERVATÓRIOS INTEGRADO À ANÁLISE PETROFÍSICA.
  - Criar um software capaz de calcular parâmetros e inferir características de um reservatório, através da análise dos dados obtidos em testes de pressão em poços e na testemunhagem do reservatório, possibilitando estimar as dimensões do campo e sua potencialidade econômica. Um diferencial importante nesta versão é a flexíbilidade na entrada de dados do usuário.
- Área:
  - Petrofísica.

