README.html

<div id="outline-container-orgf5b362c" class="outline-3">
<h3 id="orgf5b362c"><span class="section-number-3">13.23.</span> Título: ProjetoEngenharia-SimuladorDeEstimativaDeReservaUtilizandoEBM-EnfoqueReservatoriosGas</h3>
<div class="outline-text-3" id="text-13-23">
<ul class="org-ul">
<li>Link no github:
<ul class="org-ul">
<li><a href="https://github.com/ldsc/ProjetoEngenharia-SimuladorDeEstimativaDeReservaUtilizandoEBM-EnfoqueReservatoriosGas">https://github.com/ldsc/ProjetoEngenharia-SimuladorDeEstimativaDeReservaUtilizandoEBM-EnfoqueReservatoriosGas</a></li>
</ul></li>
<li>Resumo:
<ul class="org-ul">
<li>SIMULADOR DE ESTIMATIVA DE RESERVA DE RESERVATÓRIO UTILIZANDO EBM, COM ENFOQUE NOS RESERVATÓRIOS DE GÁS.</li>
<li>Aperfeiçoar a solução para determinar o volume original de fluido (principalmente gás) no reservatório, incluindo a modelagem de diferentes mecanismos de produção e a injeção de fluidos.</li>
<li>Implementar classes e métodos para representar a injeção de água, gás, polímero, surfactante, vapor e gás lift no reservatório.</li>
<li>Aprimorar a flexibilidade do programa para lidar com uma variedade de cenários de produção e injeção.</li>
<li>Refinar a lógica de cálculo do volume original de fluido para considerar os efeitos das novas classes de injeção.</li>
</ul></li>
<li>Área:
<ul class="org-ul">
<li>Engenharia de reservatório.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org91029fb" class="outline-3">
<h3 id="org91029fb"><span class="section-number-3">13.24.</span> Título: ProjetoEngenharia-SimuladorDeReservatorioMonofasico2D</h3>
<div class="outline-text-3" id="text-13-24">
<ul class="org-ul">
<li>Link no github:
<ul class="org-ul">
<li><a href="https://github.com/ldsc/ProjetoEngenharia-SimuladorDeReservatorioMonofasico2D">https://github.com/ldsc/ProjetoEngenharia-SimuladorDeReservatorioMonofasico2D</a></li>
</ul></li>
<li>Resumo:
<ul class="org-ul">
<li>SIMULADOR DE RESERVATÓRIO MONOFÁSICO 2D.</li>
</ul></li>
<li>Área:
<ul class="org-ul">
<li>Engenharia de reservatório.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orge117cf7" class="outline-3">
<h3 id="orge117cf7"><span class="section-number-3">13.25.</span> Título: ProjetoEngenharia-SimuladorDeTracoSismico</h3>
<div class="outline-text-3" id="text-13-25">
<ul class="org-ul">
<li>Link no github:
<ul class="org-ul">
<li><a href="https://github.com/ldsc/ProjetoEngenharia-SimuladorDeTracoSismico">https://github.com/ldsc/ProjetoEngenharia-SimuladorDeTracoSismico</a></li>
</ul></li>
<li>Resumo:
<ul class="org-ul">
<li>Desenvolver um programa para a gerar um traço sísmico sintético de uma formação arbitrária a partir de dados da formação com espessura da camada, velocidade de propagação da onda acústica e a densidade.</li>
</ul></li>
<li>Área:
<ul class="org-ul">
<li>Geofísica.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org697106b" class="outline-3">
<h3 id="org697106b"><span class="section-number-3">13.26.</span> Título: ProjetoEngenharia-SimuladorHidraulicaPerfuracaoPoco</h3>
<div class="outline-text-3" id="text-13-26">
<ul class="org-ul">
<li>Link no github:
<ul class="org-ul">
<li><a href="https://github.com/ldsc/ProjetoEngenharia-SimuladorHidraulicaPerfuracaoPoco">https://github.com/ldsc/ProjetoEngenharia-SimuladorHidraulicaPerfuracaoPoco</a></li>
</ul></li>
<li>Resumo:
<ul class="org-ul">
<li>Desenvolver um simulador de hidráulica de poço que execute cálculos e gere gráficos. Para tal, deve-se usar as equações de perda de carga provenientes da mecânica dos fluidos adaptadas à indústria do petróleo.</li>
</ul></li>
<li>Área:
<ul class="org-ul">
<li>Engenharia de reservatório.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgb023f85" class="outline-3">
<h3 id="orgb023f85"><span class="section-number-3">13.27.</span> Título: ProjetoEngenharia-SimuladorPropriedadesMaterialSubmetidoCorrosaoPorDioxidoDeCarbono</h3>
<div class="outline-text-3" id="text-13-27">
<ul class="org-ul">
<li>Link no github:
<ul class="org-ul">
<li><a href="https://github.com/ldsc/ProjetoEngenharia-SimuladorPropriedadesMaterialSubmetidoCorrosaoPorDioxidoDeCarbono">https://github.com/ldsc/ProjetoEngenharia-SimuladorPropriedadesMaterialSubmetidoCorrosaoPorDioxidoDeCarbono</a></li>
</ul></li>
<li>Resumo:
<ul class="org-ul">
<li>Simulador de Propriedades Mecânicas de Material Submetido ao Processo de Corrosão por Dióxido de Carbono. Desenvolver um programa que receba dados reais ou arbitrários e calcule as propriedades mecânicas do material a partir de onde serão gerados gráficos que poderão ser utilizados para análise de taxas corrosivas.</li>
</ul></li>
<li>Área:
<ul class="org-ul">
<li>Corrosão.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgc1f92ce" class="outline-3">
<h3 id="orgc1f92ce"><span class="section-number-3">13.28.</span> Título: rojetoEngenharia-SimuladorReservatorio2D</h3>
<div class="outline-text-3" id="text-13-28">
<ul class="org-ul">
<li>Link no github:
<ul class="org-ul">
<li><a href="https://github.com/ldsc/ProjetoEngenharia-SimuladorReservatorio2D">https://github.com/ldsc/ProjetoEngenharia-SimuladorReservatorio2D</a></li>
</ul></li>
<li>Resumo:
<ul class="org-ul">
<li>Em desenvolvimento.</li>
<li>Criar um software capaz de fornecer ao usuário parâmetros e características do reservatório, através da análise dos dados obtidos em testes de pressão em poços, possibilitando estimar as dimensões do campo e sua potencialidade econômica.</li>
<li>Nota: Continuidade do projeto: <a href="https://github.com/ldsc/ProjetoEngenharia-SimuladorDeReservatorioMonofasico2D">https://github.com/ldsc/ProjetoEngenharia-SimuladorDeReservatorioMonofasico2D</a></li>
</ul></li>
<li>Área:
<ul class="org-ul">
<li>Engenharia de reservatório.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgddb5b71" class="outline-3">
<h3 id="orgddb5b71"><span class="section-number-3">13.29.</span> Título: ProjetoEngenharia-SimuladorSolucoesAnaliticasAdmensionaisEqDifusividadeHidraulicaFluxosLinearERadial</h3>
<div class="outline-text-3" id="text-13-29">
<ul class="org-ul">
<li>Link no github:
<ul class="org-ul">
<li><a href="https://github.com/ldsc/ProjetoEngenharia-SimuladorSolucoesAnaliticasAdmensionaisEqDifusividadeHidraulicaFluxosLinearERadial">https://github.com/ldsc/ProjetoEngenharia-SimuladorSolucoesAnaliticasAdmensionaisEqDifusividadeHidraulicaFluxosLinearERadial</a></li>
</ul></li>
<li>Resumo:
<ul class="org-ul">
<li>SIMULADOR DE SOLUÇÕES ANALÍTICAS ADIMENSIONAIS DA EQUAÇÃO DA DIFUSIVIDADE HIDRÁULICA PARA FLUXOS LINEAR E RADIAL.</li>
<li>A partir da descoberta de uma acumulação de petróleo diversas informações podem ser obtidas. Das mais importantes, pode-se citar como exemplo a quantidade de hidro- carbonetos que se pode retirar dessa jazida e o tempo em que essa produção se efetuará. Dentro da engenharia de petróleo, engenheiros de reservatório constantemente buscam solucionar problemas envolvendo fluxos monofásicos de fluidos de baixa compressibilidade que partem das as equações fundamentais da mecânica dos fluidos que descrevem o trans- porte de líquidos em meios porosos. A principal equação que rege esse estudo do fluxo em meios porosos é a Equação da Difusividade Hidráulica e ao resolver os problemas de valor inicial e de contorno formados por essa equação, é possível obter os modelos físicos de interesse que são encontrados no campo. A necessidade de monitoramento do comportamento do reservatório é evidente e prever como será o seu comportamento auxilia diretamente na tomada de decisões a respeito das operações realizadas e serve de base para os testes de pressão que visam a obtenção de vários parâmetros do reservatório (fator de película, volume poroso drenado, limites do reservatório, etc).</li>
</ul></li>
<li>Área:
<ul class="org-ul">
<li>Engenharia de reservatório.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org9e20694" class="outline-3">
<h3 id="org9e20694"><span class="section-number-3">13.30.</span> Título: ProjetoEngenharia-SimuladorSubstituicaoFluidoEmodelagemAVO</h3>
<div class="outline-text-3" id="text-13-30">
<ul class="org-ul">
<li>Link no github:
<ul class="org-ul">
<li><a href="https://github.com/ldsc/ProjetoEngenharia-SimuladorSubstituicaoFluidoEmodelagemAVO">https://github.com/ldsc/ProjetoEngenharia-SimuladorSubstituicaoFluidoEmodelagemAVO</a></li>
</ul></li>
<li>Resumo:
<ul class="org-ul">
<li>DESENVOLVIMENTO DO SOFTWARE SIMULADOR DE SUBSTITUIÇÃO DE FLUIDOS E DE MODELAGEM AVO.</li>
<li>Realizar a substituição de fluidos para plotar um gráfico de velocidade da onda compressional pela saturação de água e de velocidade da onda cisalhante pela saturação de água.</li>
</ul></li>
<li>Área:
<ul class="org-ul">
<li>Geofísica</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org4c3b2c2" class="outline-3">
<h3 id="org4c3b2c2"><span class="section-number-3">13.31.</span> Título: ProjetoEngenharia-SoftwareCaracterizacaoDeReservatoriosIntegradoAAnalisePetrofisica</h3>
<div class="outline-text-3" id="text-13-31">
<ul class="org-ul">
<li>Link no github:
<ul class="org-ul">
<li><a href="https://github.com/ldsc/ProjetoEngenharia-SoftwareCaracterizacaoDeReservatoriosIntegradoAAnalisePetrofisica">https://github.com/ldsc/ProjetoEngenharia-SoftwareCaracterizacaoDeReservatoriosIntegradoAAnalisePetrofisica</a></li>
</ul></li>
<li>Resumo:
<ul class="org-ul">
<li>DESENVOLVIMENTO DO SOFTWARE CARACTERIZAÇÃO DE RESERVATÓRIOS INTEGRADO À ANÁLISE PETROFÍSICA.</li>
<li>Criar um software capaz de calcular parâmetros e inferir características de um reservatório, através da análise dos dados obtidos em testes de pressão em poços e na testemunhagem do reservatório, possibilitando estimar as dimensões do campo e sua potencialidade econômica. Um diferencial importante nesta versão é a flexíbilidade na entrada de dados do usuário.</li>
</ul></li>
<li>Área:
<ul class="org-ul">
<li>Petrofísica.</li>
</ul></li>
</ul>
</div>
</div>
