README.org
** Título: ProjetoEngenharia-SoftwareControlador-MedidorDeBancadaAz-pH-mV-ORP-Cond-TDS-SALT
- Link no github:
  - https://github.com/ldsc/ProjetoEngenharia-SoftwareControlador-MedidorDeBancadaAz-pH-mV-ORP-Cond-TDS-SALT
- Resumo:
  - Em desenvolvimento.
- Área:
  - Equipamentos de laboratório.

** Título: rojetoEngenharia-SoftwareDeComunicacao-MedidorLCR
- Link no github:
  - https://github.com/ldsc/ProjetoEngenharia-SoftwareDeComunicacao-MedidorLCR
- Resumo:
  - Em desenvolvimento.
- Área:
  - Equipamentos de laboratório.

** Título: ProjetoEngenharia-SoftwareParaCalculoDeIncrustacaoNaProducaoDePetroleo
- Link no github:
  - https://github.com/ldsc/ProjetoEngenharia-SoftwareParaCalculoDeIncrustacaoNaProducaoDePetroleo
- Resumo:
  - Em desenvolvimento.
- Área:
  - Engenharia de reservatório.
  - Petrofísica.

** Título: ProjetoEngenharia-SoftwareParaCalculoDePropriedadesReologicasDeFluidosDePerfuracao
- Link no github:
  - https://github.com/ldsc/ProjetoEngenharia-SoftwareParaCalculoDePropriedadesReologicasDeFluidosDePerfuracao
- Resumo:
  - Faltando esta informação.
- Área:
  - Engenharia de poço.

** Título: ProjetoEngenharia-SoftwareParaTratamentosDeDados-FT-ICR-MS-e-Aplica-esGeoquimicas
- Link no github:
  - https://github.com/ldsc/ProjetoEngenharia-SoftwareParaTratamentosDeDados-FT-ICR-MS-e-Aplica-esGeoquimicas
- Resumo:
  - Software para tratamentos de dados FT-ICR MS e aplicações geoquímicas.
  - Facilitar o uso da petroleômica.
  - Calcular o número de carbono, hidrogênio e nitrogênio.
  - Calcular a distribuição heteroatômica para cada amostra.
  - Calcular o número de DBE e sua distribuição para cada classe heteroatômica.
  - Calcular a distribuição do número de carbono por DBE para cada classe hete- roatômica.
  - Calcular parâmetros geoquímicos com os dados petroleômicos. – Plotar gráficos e diagramas.
- Área:
  - Geoquímica.

** Título: ProjetoEngenharia-SoftwareQueCalculaPropriedadesPetrofisicasPocoAPartirEquacoesDaFisica
- Link no github:
  - https://github.com/ldsc/ProjetoEngenharia-SoftwareQueCalculaPropriedadesPetrofisicasPocoAPartirEquacoesDaFisica
- Resumo:
  - ProjetoEngenharia-SoftwareQueCalculaPropriedadesPetrofisicasPocoAPartirEquacoesDaFisica.
  - Plotar os perfis.
  - Calcular a porosidade.
  - Calcular a argilosidade.
  - Calcular a saturação de óleo e água.
  - Plotar as propriedades calculadas.
- Área:
  - Petrofísica.

** Título: ProjetoEngenharia-SPTSP-Helmholtz
- Link no github:
  - https://github.com/ldsc/ProjetoEngenharia-SPTSP-Helmholtz
- Resumo:
  - SIMULADOR DE PROPRIEDADES TERMODINÂMICAS DE SUBSTÂNCIAS PURAS A PARTIR DE DENSIDADE E TEMPERATURA.
  - A correta previsão das propriedades termodinâmicas e cálculo do equilíbrio de fases constitui-se num ponto fundamental do projeto de qualquer processo da industria química, como sistemas de refrigeração. A exploração e produção de reservas naturais de hidrocarbonetos não foge a essa regra, com a dificuldade adicional de tratar complexas misturas de hidrocarbonetos, muitas vezes não bem caracterizadas, além da presença de compostos não orgânicos, como água e dióxido de carbono, empregados em técnicas para aumentar o fator de recuperação das jazidas. Na simulação numérica computacional, que usa o modelo composicional de reservatórios de hidro- carbonetos, um dos conjuntos de equações utilizado para a solução é composto pelos coeficientes de distribuição dos componentes entre as fases presentes no meio poroso. Em varios momentos da simulação uma ou mais fases podem ser constituídas de compostos puros. Nesse caso, ao invés de utilizar equações de estado, são utilizadas correlações para prever as propriedades termodinâmicas, bem como as suas derivadas (necessárias para o cálculo do jacobiano do método de Newton).
  - Objetivo geral: – Deselvolver um software que calcula as propriedades termodinâmicas de uma substância pura a partir de equações experimentais.
- Área:
  - Engenharia de reservatório.

** Título: ProjetoEngenharia-STC-3D-SimuladorDeTransferenciaDeCalor-3D
- Link no github:
  - https://github.com/ldsc/ProjetoEngenharia-STC-3D-SimuladorDeTransferenciaDeCalor-3D
- Resumo:
  - Projeto de engenharia - Simulador de condução térmica em objetos 3D com perfis genéricos.
  - O seguinte projeto de engenharia deve simular a difusão térmica de qualquer objeto tridimensional, onde o usuário desenha a superfície de alguns perfis e escolhe as temperaturas e suas propriedades termofísicas.
  - A equação do Calor será modelada por diferenças finitas pelo modelo BTCS, utilizando fronteiras de Neumann, e a programação utilizará paralelismo e multithreading para acelerar as simulações.
  - No quesito prático, o usuário poderá desenhar a superfície a ser simulada, escolher sua temperatura, propriedades termofísicas e se é fonte/sumidouro ou não. Também terá a liberdade de escolher um ponto para analisar os gráficos da evolução térmica no tempo e espaço, salvar as superfícies dos perfis e carregar essas camadas com todas as suas propriedades e modificá-las. Por fim, o projeto será utilizado para estudar a injeção de calor em reservatórios 2D e 3D, e avaliar a distribuição da temperatura ao longo do tempo no reservatório.
  - Nota: Também foi o TCC do aluno Nikolas.
- Área:
  - Transferência de calor.

