README.html

<div id="outline-container-orga27d2fd" class="outline-3">
<h3 id="orga27d2fd"><span class="section-number-3">13.32.</span> Título: ProjetoEngenharia-SoftwareControlador-MedidorDeBancadaAz-pH-mV-ORP-Cond-TDS-SALT</h3>
<div class="outline-text-3" id="text-13-32">
<ul class="org-ul">
<li>Link no github:
<ul class="org-ul">
<li><a href="https://github.com/ldsc/ProjetoEngenharia-SoftwareControlador-MedidorDeBancadaAz-pH-mV-ORP-Cond-TDS-SALT">https://github.com/ldsc/ProjetoEngenharia-SoftwareControlador-MedidorDeBancadaAz-pH-mV-ORP-Cond-TDS-SALT</a></li>
</ul></li>
<li>Resumo:
<ul class="org-ul">
<li>Em desenvolvimento.</li>
</ul></li>
<li>Área:
<ul class="org-ul">
<li>Equipamentos de laboratório.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orge60f553" class="outline-3">
<h3 id="orge60f553"><span class="section-number-3">13.33.</span> Título: rojetoEngenharia-SoftwareDeComunicacao-MedidorLCR</h3>
<div class="outline-text-3" id="text-13-33">
<ul class="org-ul">
<li>Link no github:
<ul class="org-ul">
<li><a href="https://github.com/ldsc/ProjetoEngenharia-SoftwareDeComunicacao-MedidorLCR">https://github.com/ldsc/ProjetoEngenharia-SoftwareDeComunicacao-MedidorLCR</a></li>
</ul></li>
<li>Resumo:
<ul class="org-ul">
<li>Em desenvolvimento.</li>
</ul></li>
<li>Área:
<ul class="org-ul">
<li>Equipamentos de laboratório.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgf17cdb9" class="outline-3">
<h3 id="orgf17cdb9"><span class="section-number-3">13.34.</span> Título: ProjetoEngenharia-SoftwareParaCalculoDeIncrustacaoNaProducaoDePetroleo</h3>
<div class="outline-text-3" id="text-13-34">
<ul class="org-ul">
<li>Link no github:
<ul class="org-ul">
<li><a href="https://github.com/ldsc/ProjetoEngenharia-SoftwareParaCalculoDeIncrustacaoNaProducaoDePetroleo">https://github.com/ldsc/ProjetoEngenharia-SoftwareParaCalculoDeIncrustacaoNaProducaoDePetroleo</a></li>
</ul></li>
<li>Resumo:
<ul class="org-ul">
<li>Em desenvolvimento.</li>
</ul></li>
<li>Área:
<ul class="org-ul">
<li>Engenharia de reservatório.</li>
<li>Petrofísica.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgccb193e" class="outline-3">
<h3 id="orgccb193e"><span class="section-number-3">13.35.</span> Título: ProjetoEngenharia-SoftwareParaCalculoDePropriedadesReologicasDeFluidosDePerfuracao</h3>
<div class="outline-text-3" id="text-13-35">
<ul class="org-ul">
<li>Link no github:
<ul class="org-ul">
<li><a href="https://github.com/ldsc/ProjetoEngenharia-SoftwareParaCalculoDePropriedadesReologicasDeFluidosDePerfuracao">https://github.com/ldsc/ProjetoEngenharia-SoftwareParaCalculoDePropriedadesReologicasDeFluidosDePerfuracao</a></li>
</ul></li>
<li>Resumo:
<ul class="org-ul">
<li>Faltando esta informação.</li>
</ul></li>
<li>Área:
<ul class="org-ul">
<li>Engenharia de poço.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org8730bf3" class="outline-3">
<h3 id="org8730bf3"><span class="section-number-3">13.36.</span> Título: ProjetoEngenharia-SoftwareParaTratamentosDeDados-FT-ICR-MS-e-Aplica-esGeoquimicas</h3>
<div class="outline-text-3" id="text-13-36">
<ul class="org-ul">
<li>Link no github:
<ul class="org-ul">
<li><a href="https://github.com/ldsc/ProjetoEngenharia-SoftwareParaTratamentosDeDados-FT-ICR-MS-e-Aplica-esGeoquimicas">https://github.com/ldsc/ProjetoEngenharia-SoftwareParaTratamentosDeDados-FT-ICR-MS-e-Aplica-esGeoquimicas</a></li>
</ul></li>
<li>Resumo:
<ul class="org-ul">
<li>Software para tratamentos de dados FT-ICR MS e aplicações geoquímicas.</li>
<li>Facilitar o uso da petroleômica.</li>
<li>Calcular o número de carbono, hidrogênio e nitrogênio.</li>
<li>Calcular a distribuição heteroatômica para cada amostra.</li>
<li>Calcular o número de DBE e sua distribuição para cada classe heteroatômica.</li>
<li>Calcular a distribuição do número de carbono por DBE para cada classe hete- roatômica.</li>
<li>Calcular parâmetros geoquímicos com os dados petroleômicos. – Plotar gráficos e diagramas.</li>
</ul></li>
<li>Área:
<ul class="org-ul">
<li>Geoquímica.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org43f22b5" class="outline-3">
<h3 id="org43f22b5"><span class="section-number-3">13.37.</span> Título: ProjetoEngenharia-SoftwareQueCalculaPropriedadesPetrofisicasPocoAPartirEquacoesDaFisica</h3>
<div class="outline-text-3" id="text-13-37">
<ul class="org-ul">
<li>Link no github:
<ul class="org-ul">
<li><a href="https://github.com/ldsc/ProjetoEngenharia-SoftwareQueCalculaPropriedadesPetrofisicasPocoAPartirEquacoesDaFisica">https://github.com/ldsc/ProjetoEngenharia-SoftwareQueCalculaPropriedadesPetrofisicasPocoAPartirEquacoesDaFisica</a></li>
</ul></li>
<li>Resumo:
<ul class="org-ul">
<li>ProjetoEngenharia-SoftwareQueCalculaPropriedadesPetrofisicasPocoAPartirEquacoesDaFisica.</li>
<li>Plotar os perfis.</li>
<li>Calcular a porosidade.</li>
<li>Calcular a argilosidade.</li>
<li>Calcular a saturação de óleo e água.</li>
<li>Plotar as propriedades calculadas.</li>
</ul></li>
<li>Área:
<ul class="org-ul">
<li>Petrofísica.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org50f846a" class="outline-3">
<h3 id="org50f846a"><span class="section-number-3">13.38.</span> Título: ProjetoEngenharia-SPTSP-Helmholtz</h3>
<div class="outline-text-3" id="text-13-38">
<ul class="org-ul">
<li>Link no github:
<ul class="org-ul">
<li><a href="https://github.com/ldsc/ProjetoEngenharia-SPTSP-Helmholtz">https://github.com/ldsc/ProjetoEngenharia-SPTSP-Helmholtz</a></li>
</ul></li>
<li>Resumo:
<ul class="org-ul">
<li>SIMULADOR DE PROPRIEDADES TERMODINÂMICAS DE SUBSTÂNCIAS PURAS A PARTIR DE DENSIDADE E TEMPERATURA.</li>
<li>A correta previsão das propriedades termodinâmicas e cálculo do equilíbrio de fases constitui-se num ponto fundamental do projeto de qualquer processo da industria química, como sistemas de refrigeração. A exploração e produção de reservas naturais de hidrocarbonetos não foge a essa regra, com a dificuldade adicional de tratar complexas misturas de hidrocarbonetos, muitas vezes não bem caracterizadas, além da presença de compostos não orgânicos, como água e dióxido de carbono, empregados em técnicas para aumentar o fator de recuperação das jazidas. Na simulação numérica computacional, que usa o modelo composicional de reservatórios de hidro- carbonetos, um dos conjuntos de equações utilizado para a solução é composto pelos coeficientes de distribuição dos componentes entre as fases presentes no meio poroso. Em varios momentos da simulação uma ou mais fases podem ser constituídas de compostos puros. Nesse caso, ao invés de utilizar equações de estado, são utilizadas correlações para prever as propriedades termodinâmicas, bem como as suas derivadas (necessárias para o cálculo do jacobiano do método de Newton).</li>
<li>Objetivo geral: – Deselvolver um software que calcula as propriedades termodinâmicas de uma substância pura a partir de equações experimentais.</li>
</ul></li>
<li>Área:
<ul class="org-ul">
<li>Engenharia de reservatório.</li>
</ul></li>
</ul>
</div>
</div>
